{"contributor-docs":{"README":{"relativeUrl":"/contributor-docs/README","description":"🌸مرحبا 🌺 شكرا لإهتمامك بالمساهمة p5js مجتمعنا يقدر المساهمات بكل أشكالها ويسعى توسيع معنى كلمة مساهم/ة بأقصى شكل ممكن؛ يتضمن توثيق البرمجيات، التدريس، كتابة الشيفرة البرمجية، صناعة الفن، الكتابة، التصميم، النشاطية، التنظيم، نَظْم المحتوى شيء أخر تتخيله [صفحة المجتمع خاصتنا](https://p5js.org/community/#contribute) تعطي ملخصا للطرق المختلفة المشاركة والمساهمة معنا المشروع يتبع المواصفات القياسية لمشروع [all-contributors المساهمين\"](https://github.com/kentcdodds/all-contributors). نستعمل البوت @all-contributors كي نضيف المساهمين/ات الملف READMEmd يمكنك الطلب يضيفك طريق الآتي تعليق طلب مشكلة issue جيت هب GitHub سحبpull request ``` please add @[اسم المسخدم خاصتك هب] for [نوع مساهمتك] معرفة نوع مساهمتك المناسب [هنا](https://allcontributors.org/docs/en/emoji-key)، الرغم أننا سنضيفك تلقائي قائمة المساهمين قبول السحب دليل منشور [موقع](https://p5js.org/contributor-docs/#/) ومُستضاف على[ مستودع repository هب](https://github.com/processing/p5.js/tree/main/contributor_docs) الخاص بـ المساهمة مشروع يجب تجربة خالية ضغط، فنحن نرحب بغض النظر حجمها، سواء إصلاح خطأ مطبعي بسيط إعادة هيكلة الآليات المعقدة لعرض الرسوم ثلاثية الأبعاد، توجد الأشياء معرفتها وفهمها البدء بدايةً فضلك قم/قومي بقراءة [بيان مجتمعنا](https://p5js.org/community/) نعطي الأولوية للأعمال تُزيد الوصول إمكانية والإتاحة وحقوق المعاقين/ات لـ للمزيد التفاصيل، إلقاء نظرة الإتاحة خاصتنا]/access/ استعداد لبدء العديد الطرق وأيضا الأسباب للمساهمة سياق الدليل، سنقسم قسمين تتعامل مباشر المصدرية التوثيق البرمجي مها الإطلاق المراد القيام p5js، قراءة الجزء الدليل ## [المساهمات المصدرية]/contributor_guidelines/ للقيام بمساهمة مثالية موقع إتباع الخطوات الآتية عمل مناقشة المشكلة الحصول موافقة لعمل بطلب سحب تغيير الموافقة طلبك وضمه هذه[ الصفحة]/contributor_guidelines/، سيتم توجهيك خطوة بخطوة لتنفيذ المذكورة أعلاه، استعمال فهرس الصفحة للوصول الأجزاء مراجعتها تذكرها معظم سنسير بحزم خطة العمل هذه، يصلك شعور بأننا نقوم بالعديد المناورات يبدو مساهمة بسيطة، وبخاصة قمت مشاريع أخرى رغم ذلك، فإننا نهدف بالخطوات أعلاه بأن نسهل كمساهم/ة كمتعهد/ة أوكمشرف/ة هادف معنى، نحرص يضيع وقتك يُرفض لأسباب كثيرة تساعد ضمان اقتراح نوقش وافٍ تنفيذه، سيوفر والمتعهدين/ات والمشرفين/ات الوقت، ستقل طلبات تتطلب المزيد التعديلات مراجعتها، الإصلاحات المرفوضة البداية صريح **نحن نرى كفرصة للتعلم** نقيس النجاح بعدد تصلنا مهلة تَحدُك مساهمتك، لذا اتخاذ والسرعة المناسبة لك نراسلك غبت لفترة طويلة سؤال المتعهدين/ات المشرفين/ات احتجتهم وسوف نبذل قصارى جهدنا نساعدك بعيدا المصدرية، أكثر نحصيها هنا، تتضمن كإضافة الأمثلة، درس للموقع، إلخ المخطط لها، لدينا القدرة مساعدتك بطرق عدة، التواصل عبر قناة قنوات المتاحة البريد الإلكتروني، وسائل الإجتماعي، منتدى النقاش، ديسكورد، [المتعهدين/ات والمشرفين/ات]/steward_guidelines/ للدليل بالمتعهدين/ات الصيانة العامة لمستودع هب، [دليل المتعهدين]/steward_guidelines/"}},"contributor-docs-fallback":{"README":{"relativeUrl":"/contributor-docs/README","description":"🌸 🌺 interest contributing p5js community values contributions forms seeks expand meaning word contributor wide includes documentation teaching writing code making art design activism organizing curating imagine [Our page](https://p5js.org/community/#contribute) overview ways involved contribute project [all-contributors](https://github.com/kentcdodds/all-contributors) specification @all-contributors bot handle adding people READMEmd file add issue PR comment ``` @[your GitHub handle] [your contribution type] find relevant type [here](https://allcontributors.org/docs/en/emoji-key). automatically list merging docs published [website](https://p5js.org/contributor-docs/#/), hosted [GitHub repository](https://github.com/processing/p5.js/tree/main/contributor_docs). Contributing stress free experience levels fixing small typo refactoring complex 3D rendering functionalities things familiar starting read [community statement](https://p5js.org/community/). prioritizing work expands access inclusion accessibility [our statement]/access/ details Started ready start started reasons purpose split roughly categories * Contributions directly deals source including Depending kind section ## [Source contribution]/contributor_guidelines/ typical p5js-website repository follow steps Open Discuss Approved opening Pull Request Make merged Head [this link]/contributor_guidelines/ guided step time navigate table contents page skip part refresher stick workflow strictly contributed projects feel hoops jump simple aimed make easy stewards/maintainers meaningfully spending working accepted ensure proposals fixes adequately discussed considered begin save steward/maintainer additional review outright happen result **We learning opportunity** measure sucess volume received limit long takes complete pace check period inactivity stewards maintainers support Non-source non-source exhaustively listed involve repositories examples tutorials website planned reach channel email social media [Discourse forum](https://discourse.processing.org/c/p5js/10), Discord [Stewards maintainers]/steward_guidelines/ information related area general maintenance [steward guidelines]/steward_guidelines/"},"access":{"relativeUrl":"/contributor-docs/access","description":"Focus Access [2019 Contributors Conference](https://p5js.org/community/contributors-conference-2019.html), p5js made commitment add features increase access inclusion accessibility accept feature requests support efforts commit work acknowledging dismantling preventing barriers means intersecting[^1] experiences diversity impact participation include alignments gender race ethnicity sexuality language location cetera center marginalized groups continued comfort privileged community collectively exploring meaning learning practice teach choose expansive intersectional coalitionary frameworks part core values outlined [Community Statement](https://p5js.org/community/). Kinds Increasing focused expanding raw number people make left consequence structural bias extends tools platforms offers includes makeup decision-making actions leadership resist technological culture speed growth competition prioritize intentionality slowness accommodation accountability acts collective care making equitable * People speak languages English color ethnic identities Lesbian gay bisexual trans queer questioning intersex pansexual two-spirit asexual Women expressions Disabled people/people disabilities neurodivergent neurodivergence chronically ill chronic illness[^2] lower income lack financial cultural capital prior experience open source creative coding diverse educational backgrounds age including children elders variety skill internet religious systematically excluded historically underrepresented intersections thereof recognize complexity terms describe respective Language nuanced evolving contested exhaustive list provide attempt accountable commitments Examples examples Translating documentation materials decentering linguistic imperialism[^3] Rolando Vargas [Processing Kuna Language](https://medium.com/@ProcessingOrg/culture-as-translation-processing-in-kuna-language-with-rolando-vargas-and-edinson-izquierdo-8079f14851f7), Felipe Santos Gomes Julia Brasil Katherine Finn Zander Marcela Mancinos [Pê Cinco Internationalization Popularization Portuguese Speakers](https://medium.com/processing-foundation/translating-p5-js-into-portuguese-for-the-brazilian-community-14b969e77ab1)) Improving assistive technologies screen readers Katie Lius [Adding Alt Text p5.js](https://medium.com/processing-foundation/adding-alt-text-e2c7684e44f8), Claire Kearney-Volpes [P5 Accessibility Project](https://medium.com/processing-foundation/p5-accessibility-115d84535fa8)) [Web Content Guidelines](https://www.w3.org/TR/WCAG21/) working easier users follow projects Making error messages helpful supportive tool [p5js Friendly Error System (FES)](https://github.com/processing/p5.js/blob/main/contributor_docs/friendly_error_system/)) Mentoring supporting learners communities digital arts Hosting events Day 2022](https://p5js.org/community/p5js-access-day-2022.html), [The Web W3C TPAC 2020)](https://medium.com/processing-foundation/p5-js-x-w3c-tpac-bee4c621a053) access-centered organizing tactics ASL interpretation live captioning accessible venues Supporting creation resources Adekemi Sijuwade-Ukadikes [A11y Syllabus](http://a11ysyllabus.site/)) Publishing reports WCAG guidelines plain focus beginners [OSACC Report](https://github.com/processing/OSACC-p5.js-Access-Report)) Maintenance accepting effort criteria reflected issue pull request templates affirm intention maintain existing set fix bugs area codebase consistency makes improve Performance increases powerful hardware Support drawing to/reading framebuffers Consistency API Add arcVertex creating arcs beginShape/endShape *** living document continue conversation invite engage describes ideas suggestions share Github emailing [hello@p5jsorg]mailtohello@p5jsorg version Statement revised collaboration Evelyn Masso Nat Decker Bobby Joe Smith III Sammie Veeler Sonia Suhyun Choi Xin Kate Hollenbach Lauren Lee McCarthy Caroline Sinders Qianqian Ye Tristan Jovani Magno Espinoza Tanvi Sharma Tsige Tafesse Sarah Ciston Open Source Arts Conference finalized published Processing Foundation Fellowship [^1] Crenshaw Kimberlé Demarginalizing intersection sex black feminist critique antidiscrimination doctrine theory antiracist politics University Chicago Legal Forum 139–167 ISSN 0892-5593 Full text Archiveorg [^2] differing preferences person-first identity-first disability Read [Unpacking debate autism community](https://news.northeastern.edu/2018/07/12/unpacking-the-debate-over-person-first-vs-identity-first-language-in-the-autism-community/) [I Identity-First Versus People-First Language](https://thebodyisnotanapology.com/magazine/i-am-disabled-on-identity-first-versus-people-first-language/). [^3] Linguistic Imperialism refers ongoing domination/prioritization/imposition expense native due imperial expansion globalization"},"archive":{"relativeUrl":"/contributor-docs/archive/roadmap","description":"p5js Roadmap \\[WIP] document list features improvements maintenance items future version draft created working group UCLA Design Media Arts put feedback updated significantly revised Contributors Conference schedule August goal release end exception ES6 migration tasks ordered priority [milestones](https://github.com/processing/p5.js/milestones) github prioritize releases track progress ## * Phase User facing p5jsorg tutorials issue tutorial examples section reference Developer Build processes docs Codebase TBD dedicated person start determined phase materials -- extent external Started book Coding Train ensure smooth rollout educational resources Contributed libraries Maintenance Audio updates pending Chrome user interact Update documentation page FES warn complete unit tests Clearer Improve Friendly Error System Add comments [https://github.com/processing/p5.js/blob/main/src/core/friendly\\_errors/fes\\_core.js](https://github.com/processing/p5.js/blob/main/src/core/friendly_errors/fes_core.js) whats happening process Bug fixing Mobile device support / upgrades WebGL robustness Lighting lights implementation pixel lighting default Simplify shader pipeline shape rendering method shapes construct geom object retain mode Features Shapes createShape public API returning p5Geometry equivalent 2D SVG GIF image createImg good work students love gifs i18n localisation error messages + Develop infrastructure localizing console codebase Translate K-12 discussed [in thread](https://github.com/processing/p5.js/issues/2305) add circle square makeyourownalgorithmicart/simplejs Implement Promises library Confirm/implement Open loadX functions lower Contributor tickets incompleteness areas Testing Feature Translation Stricter [semantic versioning](https://semver.org/) Clarify soliciting roadmap input versions drop sweet set curated artists coders"},"contributing_documentation":{"relativeUrl":"/contributor-docs/contributing_documentation","description":"Contributing Documentation essential learners experienced programmers alike helps make community inclusive extending friendly hand familiar p5js find bugs issues code test things document ways contribute documentation ## ☝️ Make started helpful improving notice typo missing broken function description confusing * correcting small feel free ahead work send PR finished fixing alright [opening issue](https://github.com/processing/p5.js/issues). unsure [open issue](https://github.com/processing/p5.js/issues) 🗯 Contribute reference Read [reference](http://p5js.org/reference/), typos examples straightforward fix involved question requires discussion create [issue](https://github.com/processing/p5.js/issues/new). instructions [getting setup time repo]/README/ built inline source found `src/` folder information [how update add examples]/inline_documentation/ [documentation style guide]/documentation_style_guide/ writing samples errors [spanish documentation](http://p5js.org/es), [here](https://github.com/processing/p5.js-website#internationalization-i18n-and-structure). Community-maintained Typescript definitions [here](https://github.com/p5-types/p5.ts). ✨ meant simplistic snippets longer complex working porting [processing page](https://processing.org/examples/) [p5js page](http://p5js.org/examples). [here](https://github.com/processing/p5.js-website/blob/main/contributor_docs/Adding_examples/). Alternatively set publish independently share online tag [@p5xjs](https://twitter.com/p5xjs) email [hello@p5jsorg]mailtohello@p5jsorg wide [guide embedding p5.js](https://github.com/processing/p5.js/wiki/Embedding-p5.js) posting log [issues](https://github.com/processing/p5.js/issues). 👯 tutorials great place start making tutorial teach page](https://processing.org/tutorials) learn page](http://p5js.org/learn). [here](https://p5js.org/learn/tutorial-guide.html). subjects format encourage created specific audience case mind p5 journalists activists poets kids seniors dreamers language included learning invitation communicate Feel experimental Check [Sharon De La Cruz's talk Code Slang](https://www.youtube.com/watch?v=CFT6w9NKfCs) inspiration 👉 statement](http://p5js.org/community/) Optional [contributor docs]/README/ overview repository build relevant GitHub slack/gitter/etc channel join Add [contributors list](https://github.com/processing/p5.js#contributors) readmemd file Instructions [here](https://github.com/processing/p5.js/issues/2309). bug fixer kind person jump [issues](https://github.com/processing/p5.js/issues)!"},"contributing_to_the_p5.js_reference":{"relativeUrl":"/contributor-docs/contributing_to_the_p5.js_reference","description":"Contributing p5js Reference author code reference [reference](https://p5js.org/reference/) page website including alongside librarys source specialized comments include description functions signature parameters return usage examples words content function/variables built document show write format eventually rendered correctly follow guide editing writing function variable ## quick introduction work lines library ``` /** * Calculates sine angle `sin` geometric tasks creative coding values returned oscillate -1 input increases takes account current angleMode @method sin @param {Number} @return @example draw { background200 = frameCount sint + linex circlex describe'A white ball string oscillates down' } sinx pointx series black dots form wave pattern' cost infinity symbol' */ actual JavaScript defines start `/**` end `*/` line starting `*` block manner interpreted documentation familiar style [JSDoc](https://jsdoc.app/). JSDoc similar tool called [YUIDoc](https://yui.github.io/yuidoc/), syntax comment divided individual elements Lets break section compare [`sin()`](https://p5js.org/reference/#/p5/sin). top text markdown HTML concise describe details quirks behaviors typically sections `@` symbol keywords `@method` define case note brackets `` `@param` arguments accepts keyword stored curly `{}` type parameter word rest `@return` generically {type} Description optional add square [name] ### Additional info Constants defined [`constants.js`](https://github.com/processing/p5.js/blob/main/src/core/constants.js) `{Constant}` valid enumerated `either` {Constant} horizAlign horizontal alignment LEFT CENTER types data tag left Chaining method returns parent object skip @chainable signatures multiple options individually [`background()`](http://p5js.org/reference/#p5/background) number Syntax Choose version list template additional tags background {String} colorstring color formats integer rgb rgba percentage 3-digit hex 6-digit [a] alpha gray specifies Multiple create separate difference addition Limit feature unnecessary noise variables looked references constants Variables structure system mouseX position mouse relative canvas top-left corner 2-D -width/2 -height/2 WebGL touch hold recent point @property @readOnly // Move background244 linemouseX describe'horizontal moves x-position' `mouseX` `@property` defining `@readonly` present internally overwritten directly user Adding `mouseX`s talked `@example` run visit [Screenshot red showing section]/images/contributor-docs/reference-screenshotpng relevant const color255 fillc rect15 Sets redValue redc fillredValue rect50 rectangles edges rectangle yellow opening closing insert basic principle good things simple minimal meaningful explain works complicated 100x100 pixels `setup` included automatically wrapped default created wont practices featureTo closed separated blank arc50 PI QUARTER_PI OPEN describe'An ellipse arc open' describe'The bottom half arc' execute class `norender` describe'ellipse part automated tests requires interaction `notest` setup createCanvas100 saveCanvasc myCanvas' jpg' external asset files put [/docs/yuidoc-p5-theme/assets](https://github.com/processing/p5.js/tree/main/docs/yuidoc-p5-theme/assets) folder reuse link assets/filenameext [tint()](http://p5js.org/reference/#/p5/tint) Add `describe` Finally required screen-reader accessible Include happening xoff background204 noisexoff width linen height vertical randomly right' noiseScale background0 [web accessibility contributor documentation](https://p5js.org/contributor-docs/#/web_accessibility?id=user-generated-accessible-canvas-descriptions). tools needed edit situationally `@private` property private marked reason mark internal features `_start` _start calls preload @private p5prototype_start `@module` related file Modules correspond group split Inside module submodules `@submodule` `@for` relationship `p5` effectively `@requires` imported modules depends @module Color @submodule Creating Reading @for p5 @requires core convention subfolder `src/` inside subfolders adding subfolders/files shouldnt `@class` Class constructors `@constructor` classs constructor `p5Color` stores mode level maxes active construction interpret passed object's determine output formatting saturation array ideal RGBA floating normalized calculate closest screen colors levels Screen renderer representations calculated results cached performance floating-point numbers recommended instance @class p5Color @constructor {p5} [pInst] pointer {Number[]|String} vals green blue channel CSS Generating previewing repository set generate preview needing build main command npm docs `docs/reference/datajson` minification render continuous docsdev launch live update time make refresh making running browser `docs/` cases `docs/yuidoc-p5-theme/assets` steps checkout [JSDoc](https://jsdoc.app/) [YUIDoc](https://yui.github.io/yuidoc/). issues [#6519](https://github.com/processing/p5.js/issues/6519) [#6045](https://github.com/processing/p5.js/issues/6045). [contributor guidelines](https://docs.google.com/document/d/1roBu-7s9xspuie3M6EhEokYWc82DZhDNYO2SQiY4k68/edit?tab=t.0#heading=h.627q50vo09fb) place"},"contributor_guidelines":{"relativeUrl":"/contributor-docs/contributor_guidelines","description":"Contributor Guidelines contributor guidelines document contributors contribute code p5js refresh memories technical steps contributions repositories writing tutorials planning classes organizing events relevant pages Stewards maintainers find [steward guidelines](https://github.com/processing/p5.js/blob/main/contributor_docs/steward_guidelines/) helpful reviewing issues pull requests long comprehensive signpost points utilize table contents sections Feel free skip planned **If start section step-by-step setup development process Quick Started Developers section** Table Contents * [All issues]#all-about-issues [What issues]#what-are-issues [Issue templates]#issue-templates [Found bug]#found-a-bug [Existing Feature Enhancement]#existing-feature-enhancement [New Request]#new-feature-request [Discussion]#discussion [Working codebase]#working-on-the-p5js-codebase [Quick Developers]#quick-get-started-for-developers [Using Github edit functionality]#using-the-github-edit-functionality [Forking working fork]#forking-p5js-and-working-from-your-fork Desktop]#using-github-desktop git command line interface]#using-the-git-command-line-interface [Codebase breakdown]#codebase-breakdown [Build setup]#build-setup [Git workflow]#git-workflow [Source code]#source-code [Unit tests]#unit-tests [Inline documentation]#inline-documentation [Internationalization](https://github.com/processing/p5.js/blob/main/contributor_docs/contributor_guidelines.md#internationalization) [Accessibility]#accessibility [Code standard]#code-standard [Software Design principles]#software-design-principles [Pull requests]#pull-requests [Creating request]#creating-a-pull-request request information]#pull-request-information [Title]#title [Resolves]#resolves [Changes]#changes [Screenshots change]#screenshots-of-the-change [PR Checklist]#pr-checklist [Rebase resolve conflicts]#rebase-and-resolve-conflicts [Discuss amend]#discuss-and-amend *** majority activity GitHub repo short great place contribution journey ## [A cropped screenshot library repository showing top corner red box drawn surrounding Issues tab]/images/contributor-docs/issues-tabpng Issue generic post aims describe issue bug report add feature discussion works related Comments added account including bots discuss topics project opened wide variety reasons source Topics debugging inviting collaborators unrelated discussed [forum](https://discourse.processing.com) platforms [Discord](https://discord.gg/SHQ8dH25r9). created easy-to-use templates aid deciding topic posted p5js's make easier stewards understand review file receive reply faster [Screenshot title Warning logged Safari filter shader 2D mode #6597]/images/contributor-docs/github-issuepng simply tab click button side presented options corresponds template redirects question recommend choosing option ensure receives attention promptly [Cropped repository's page green highlighted it]/images/contributor-docs/new-issuepng ### bug\"](https://github.com/processing/p5.js/issues/new?assignees=\\&labels=Bug\\&projects=\\&template=found-a-bug.yml) encounter incorrect behavior behaving documentation [this template](https://github.com/processing/p5.js/issues/new?assignees=\\&labels=Bug\\&projects=\\&template=found-a-bug.yml). note debug sketch problem [Discourse forum](https://discourse.processing.org) fields fill *Most sub-area p5js* - helps identify respond automatically tagging [labels](https://github.com/processing/p5.js/blob/main/contributor_docs/issue_labels/). *p5js version* version number `` tag link p5js/p5minjs similar `142` numbers separated periods *Web browser isolate behaviors browsers follow instructions Chrome Firefox address bar navigate `chrome//version` `aboutsupport` menu item choose *Operating System* include OS `macOS 125` bugs stem *Steps reproduce this* arguably important information share list detailed replicating Sharing basic sample demonstrates replicate facing formulating solution **Replication key** aimed provide sketch's environment solutions **Be avoid statements** image function work specific display loaded GIF size things expect expected actual fix reported description simple suggestion support **You approved implementation** proposed accepted approach filed fixing closed approval reports [area steward maintainer](https://github.com/processing/p5.js#stewards) begin Enhancement\"](https://github.com/processing/p5.js/issues/new?assignees=\\&labels=Enhancement\\&projects=\\&template=existing-feature-enhancement.yml) propose functionality existing features functions constants rendering define color `color` accept colors *Increasing Access* required field insert statement adding enhancement [increase access](https://github.com/processing/p5.js/blob/main/contributor_docs/access/) people historically marginalized creative arts technology **No proposals this** offer members community argument addresses accessibility *Feature details* proposal good includes clear case needed guarantee Request\"](https://github.com/processing/p5.js/issues/new?assignees=\\&labels=Feature+Request\\&projects=\\&template=feature-request.yml) drawing native HTML elements `createTable` overlap cases whichever feel form identical Existing Enhancement [previous section]#existing-feature-enchancement details maintainers](https://github.com/processing/p5.js#stewards) [\"Discussion\"](https://github.com/processing/p5.js/issues/new?assignees=\\&labels=Discussion\\&projects=\\&template=discussion.yml) filing fit fitting rare practice adopt Web API [new request](https://github.com/processing/p5.js/blob/main/contributor_docs/contributor_guidelines.md#new-feature-request); additional [feature enchancement](https://github.com/processing/p5.js/blob/main/contributor_docs/contributor_guidelines.md#existing-feature-enchancement); announcement local coding event forum contacting Processing Foundation publicity opening Labels panel panels labels area bare minimum text link](https://github.com/processing/p5.js/issues/6517) [**⬆ back top**]#contributor-guidelines Working codebase Prerequisites proceed minimally familiar nodejs v18 Introduction implementation ready Similarly joined discussions original author volunteer submit assign jump queue** PR willingness assigned prioritize serve order accepting months individual check leaving polite comment progress generally time frame basis takes pace confident hard limit spend trouble aspect hesitate guide work/contribute p5js'🌸 developer directly improving sub-projects [Friendly Error Systems](https://github.com/processing/p5.js/blob/main/contributor_docs/friendly_error_system/), [Create fork p5.js.](https://docs.github.com/en/get-started/quickstart/fork-a-repo) [Clone computer.](https://docs.github.com/en/repositories/creating-and-managing-repositories/cloning-a-repository) [Add upstream command](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/working-with-forks/configuring-a-remote-repository-for-a-fork): ``` remote https://github.com/processing/p5.js Make machine [NodeJs](https://nodejs.org/en/download) installed node -v Install dependencies npm ci Create branch `main` descriptive checkout -b [branch_name] making frequently run tests ensures broken test Add unit commit create Request](https://p5js.org/contributor-docs/#/./contributor_guidelines?id=pull-requests). viewing web interface content pencil icon convenient provided simplifies processes covering quick edits view src/color/color\\_conversionjs arrow pointing image]/images/contributor-docs/edit-filepng recommended main complex built tested locally fluent compared editing Forking step meaning open purpose means creating copy storing Fork labeled 593k outlined dark orange]/images/contributor-docs/forkpng direct write access official Desktop program lets graphical user typing commands terminal switch [download install Desktop.](https://desktop.github.com/) application sign signed projects Select named `yourUsername/p5js` blue Clone change leave default settings continue [The signing half screen lists bottom right]/images/contributor-docs/github-desktop-initpng cloned plan parent Continue cloning asks purposes]/images/contributor-docs/github-desktop-forkpng `git` fork's URL clicking Code `https://github.com/limzykenneth/p5.js.git`. files landing orange outline]/images/contributor-docs/code-buttonpng clone download Run folder store [git_url] Replace `[git_url]` copied minutes depending speed internet connection coffee finished downloaded `p5js` preferred editor Codebase breakdown key folders `src` eventually combined final p5minjs lives [`test`](https://github.com/processing/p5.js/blob/main/contributor_docs/unit_testing/) testing examples `tasks` custom build `Gruntfilejs` configuration `contributor_docs` configurations kinds modifications Build set Assuming downloads Pretty Git workflow parts subsections building scratch complete errors running `lib/` `p5minjs` starting implies branched commits affecting branches Branches enable multiple isolated confidence mess affect Current Branch header window enter purposes describing selection entering exist appears]/images/contributor-docs/github-desktop-create-branchpng `git branch_name` replacing `branch_name` separate `npm test` Running breaking moving committing made collection saved essentially records current state arise general aim lump big guideline completed subtask sentence app show changed left sidebar Type high-level elaborate blank Click Commit finalize circled lower window]/images/contributor-docs/github-desktop-commitpng Check status listed [restore](https://git-scm.com/docs/git-restore) intended diff intend Stage -m [your_commit_message] `[your_commit_message]` replaced message avoiding statements `Documentation 1` `Add circle function` Repeat periodically Source visit documented reference website Notice typos src/core/shape/2d\\_primitivesjs Part underline it]/images/contributor-docs/reference-code-linkpng Unit [here](https://github.com/processing/p5.js/blob/main/contributor_docs/unit_testing/). Note implementations included Inline inline [here](https://github.com/processing/p5.js/blob/main/contributor_docs/inline_documentation/). Accessibility [here](https://github.com/processing/p5.js/blob/main/contributor_docs/web_accessibility/). Friendly System [here](https://github.com/processing/p5.js/blob/main/contributor_docs/friendly_error_system/). standard style enforced [ESLlint](https://eslint.org/). pass linting easiest ESLint plugin error highlighting popular editors Software principles mind design priorities differ coming familiarize **Access** foremost decisions increases groups Read **Beginner Friendly** friendly beginner coders offering low barrier interactive visual cutting-edge HTML5/Canvas/DOM APIs **Educational** focused curriculum supports educational supporting class curricula introduce core engaging **JavaScript community** practices accessible beginners modeling proper JavaScript patterns usage abstracting open-source wider creation dissemination **Processing inspired language transition Java easy Pull applicable committed preparing merged formally merge forked history Creating push uploading changes[A online red]/images/contributor-docs/publish-branchpng uploaded prompting Clicking preview Press Request pushing items pane Review marked circle]/images/contributor-docs/preview-pull-requestpng -u origin dropdown Contribute Open ![](https://lh7-us.googleusercontent.com/xoqM9gLSFXyw7b3gzG8JlHqoO0zxHALbjSz93E3D0HNh4Jw2wDWdzHKUEchnB6hdjQC7hVn-o5prrXkLw2WiEOoVKJF6kpmyA65sirN0z-Vy3PBY3rCXC5Ifn5stQhcdUQxQS0rsVoW0_hlkfTcY8PQ) yellow call action Compare request]/images/contributor-docs/recent-pushes prepopulated template]/images/contributor-docs/new-prpng Title briefly Resolves `Resolves #[Add here]` replace `[Add addressing/fixing [above](https://github.com/processing/p5.js/blob/main/contributor_docs/contributor_guidelines.md#all-about-issues) #1234` close `Resolves` `Addresses` Include Screenshots optional circumstances renders visuals canvas Checklist checklist tick `[ ]` `[x]` Rebase conflicts Fix shaders rectMode applied #6603]/images/contributor-docs/opened-prpng inspect pay match times Commits Files base resolved true [rebase](https://git-scm.com/book/en/v2/Git-Branching-Rebasing) Conflicts recently resolving Basic instruction Resolve button[A conflicting filenames highlighted]/images/contributor-docs/resolve-conflictspng shown `>>>>>>` `=======` shows GitHub's conflict resolution markers highlighted]/images/contributor-docs/conflicts-interfacepng Remove Mark addressed remove mark upper enabled]/images/contributor-docs/mark-as-resolvedpng enabled]/images/contributor-docs/commit-mergepng complicated prefer manual method https://github.com/processing/p5.js` fetch upstream` rebase upstream/main` lib/p5js lib/p5minjs --continue push` Discuss amend maintainer days patient meantime reviewed happen hurray questions panic perfectly normal requested [same before](https://github.com/processing/p5.js/blob/main/contributor_docs/contributor_guidelines.md#git-workflow) pushed Leave reviewer"},"creating_libraries":{"relativeUrl":"/contributor-docs/creating_libraries","description":"Creating Addon Library p5js addon library JavaScript code extends adds core functionality wide range doesnt aim cover Web API libraries extend needing incorporate features guide steps creating loads simple CSV file implementing `loadCSV` function examples create * Provide simplified interface [p5.ble.js](https://github.com/ITPNYU/p5.ble.js) [p5.serialserver](https://github.com/p5-serial/p5.serialserver) Implement specialized algorithms functionalities [p5.pattern](https://github.com/SYM380/p5.pattern) [p5.mapper](https://github.com/jdeboi/p5.mapper) Test widely browsers [p5.webserial](https://github.com/gohai/p5.webserial/) [p5.joystick](https://github.com/Vamoss/p5.joystick) alternative implementations existing [número](https://github.com/nickmcintyre/numero) [p5.cmyk.js](https://github.com/jtnimoy/p5.cmyk.js) ## Prerequisites foundation Prototype-based object orientation Javascript Step lets blank call p5loadcsvjs main adding methods p5prototype p5 add method ```js p5prototypeloadCSV = function{ consolelog'I load soon' } ``` includes project global `createCanvas` `background` classes as` p5Element` or` p5Graphics` prototypes `p5Elementprototype` extended `shout` exclamation mark end elements HTML p5Elementprototypeshout { thiseltinnerHTML += ' attached `p5prototype` method` loadCSV` logs message console Run sketch the` ` tag setup createCanvas400 loadCSV ```html Running print single accept argument defined parameter filename consolelog`I ${filename} soon` test // Prints datacsv loadCSV'datacsv' access functions variables `circle` `PI` `this` `hour` `minute` customize give information called `function` keyword attach Dont arrow syntax =>` created refer `window` => === window true refers consolelogthis ${thishour}${thisminute}` looked handy implement algorithm perform drawings previous started explore source module written inside details work hood utilize advanced made files asynchronous p5jss loading `loadJSON` `loadStrings` make functionfilename{ result [] fetchfilename thenres restext thendata datasplit'\\n'forEachline resultpushlinesplit'' return creates empty array variable `result` Fetch parse split line rows row words run pass path log output setup{ myCSV printmyCSV notice logging data reason `preload` nature makes returned `fetch` finish fetching Simply moving case solve problem preload{ prints told addons wait `registerPreloadMethod` filename{ this_decrementPreload p5prototyperegisterPreloadMethod'loadCSV' Note things `p5prototyperegisterPreloadMethod` passing string parsed pushed `this_decrementPreload` `myCSV` populated due inherent limitations technique type overwritten body set properties push reassign `result datasplit\\n` bit magic happening firstly additional running related objects passed reference types strings numbers means points original `let []` contrast returning copied lose relation behavior modify long dont separate internal list track detects counter larger waiting defer `setup` starting `draw` loop Loading decrement calling effectively signaling complete reaches loadings start expected callback support `p5prototypes` major feature action hooks Action lifetime runs clean removed `remove` enable order execution `init` — Called initialized initialization `p5` constructor executed mode automatically assigned active `beforePreload` `afterPreload` `beforeSetup` `afterSetup` `pre` beginning repeatedly `post` hook snippet p5prototypedoRemoveStuff cleanup p5prototyperegisterMethodremove p5prototypesetDefaultBackground Set background pink default thisbackground#ed225d p5prototyperegisterMethodpre unregister longer needed p5prototypeunregisterMethod'remove' extra tips authoring **Must extend** **or prototype p5\\* classes** offer constants instantiated mix offering convenience **Naming conventions** **Don't overwrite properties** extending careful names intend replace **p5js modes instance mode** bound allowing users prefix native `Math` `console` shouldnt named **Class use** `PascalCase`** `camelCase`**** Classes prefixed namespace **do include the** **prefix class names** welcomed non-prefixed p5prototypep5MyClass p5prototypemyAddonMyClass p5prototypemyMethod filenames word lowercase** distinguish p5soundjs encouraged follow format naming **Packaging** **Create JS library** easy projects suggest [bundler](https://rollupjs.org/) provide options normal sketching/debugging [minified](https://terser.org/) version faster **Contributed hosted documented maintained creators** GitHub website fully open **Documentation key** documentation find contributed wont included similar [library overview page](http://p5js.org/reference/#/libraries/p5.sound), [class page](http://p5js.org/reference/#/p5.Vector), [method page](http://p5js.org/reference/#/p5/arc). **Examples great too** show people online download anything[ ](http://jsfiddle.net/)You 0a collection web editor showcase works **Let know** ready distribution send email [hello@p5jsorg]mailtohello@p5jsorg link info [libraries page](http://p5js.org/libraries/)! [p5js.org/libraries](https://p5js.org/libraries) page fill [this form](https://docs.google.com/forms/d/e/1FAIpQLSdWWb95cfvosaIFI7msA7XC5zOEVsNruaA5klN1jH95ESJVcw/viewform)."},"custom_p5_build":{"relativeUrl":"/contributor-docs/custom_p5_build","description":"Creating custom build p5js select components ## Overview excellent [feature](https://github.com/processing/p5.js/pull/2051) user combination modules greatly helps reducing production version size library improves performance feature suggested part proposal Google Summer Code Usage usage invoking Grunt task manually command line ```sh git clone https://github.com/processing/p5.js.git cd npm ci run grunt combineModulesmodule_xmodule_y ``` `module_n` refers Multiple passed shown folders `/src` directory work correctly `core` included default `core/shape` shapes core features output `p5Customjs` larger complete `p5minjs` minified `uglify` recommended steps reduce bundle combineModulesminmodule_xmodule_y uglify Examples * `npm combineModulesmincore/shapecolormathimage uglify`\\ Generates `p5Customminjs` `lib/modules` combineModules tasks Note listed `combineModulesmin` space list combineModulescore/shapecolormathimage`\\ non-minified combineModulesmincore/shapecolormathimage`\\ `p5Custompre-minjs` uglify` separately running"},"design_principles":{"relativeUrl":"/contributor-docs/design_principles","description":"Design principles p5js * **Beginner Friendly** API aims friendly beginner coders offering low barrier creating interactive visual web content cutting-edge HTML5/canvas/DOM APIs **Educational** focused curriculum supports educational including complete reference supporting examples tutorials sample class curricula introduces core creative coding clear engaging order **JavaScript community** make development practices accessible beginners modeling proper JavaScript design patterns usage abstracting open source library includes wider community creation documentation dissemination **Processing direct response Processing language transition easy Supporting priority expanding include possibilities taking Processing-style approach exposing"},"documentation_style_guide":{"relativeUrl":"/contributor-docs/documentation_style_guide","description":"Documentation Style Guide guidelines writing p5js documentation document remix resources * Ruby Rails [API Guidlines](https://guides.rubyonrails.org/api_documentation_guidelines.html) CC BY-SA WordPress [accessibility](https://make.wordpress.org/docs/style-guide/general-guidelines/accessibility/) [inclusivity](https://make.wordpress.org/docs/style-guide/general-guidelines/inclusivity/) CC0 Airbnb [JavaScript Guide](https://airbnb.io/javascript/) MIT community large diverse people learn code subset students K–12 classes reading guide write effective inclusive accessible prose purposes simple samples ## Table Contents ### Writing [YUIDoc]#yuidoc [English]#english [Oxford Comma]#oxford-comma [Wording]#wording [Unbiased Documentation]#unbiased-documentation [Accessibility Disability]#accessibility-and-disability Code [Code Samples]#code-samples [Comments]#comments [Whitespace]#whitespace [Semicolons]#semicolons [Naming Conventions]#naming-conventions [Variables]#variables [Strings]#strings [Boolean Operators]#boolean-operators [Conditionals]#conditionals [Iteration]#iteration [Objects]#objects [Arrays]#arrays [Functions]#functions [Arrow Functions]#arrow-functions [Classes]#classes [Assets]#assets YUIDoc generate API docs navigate root directory run `npm install` execute ``` $ npm grunt yuidev output docs/reference Refer [inline guide]/inline_documentation/ information **[⬆ back top]#table-of-contents** English American color center modularize [a list British spelling differences here](https://en.wikipedia.org/wiki/American_and_British_English_spelling_differences). Oxford Comma comma](https://en.wikipedia.org/wiki/Serial_comma) red white blue Wording Write declarative sentences Brevity point present tense Returns object Returned return Start comments upper case Follow regular punctuation rules ```javascript // Draws fractal Julia set function drawFractalc radius maxIter { } Communicate current things explicitly implicitly idioms recommended Reorder sections emphasize favored approaches needed model practices approachable beginners comprehensive Explore edge cases combination arguments bugs beginner's Spell names correctly CSS HTML JavaScript WebGL doubt refer authoritative source official Unbiased bias kind person documenting demanding/sensitive topics time educate Ensure doesnt hurt offend unintentionally unbiased gender identity expression sexual orientation race ethnicity language neuro-type size disability class religion culture subculture political opinion age skill level occupation background Make examples Avoid politicized content remain neutral accessibility insult harm Dont make generalizations countries cultures includes positive prejudiced discriminatory minority communities terms related historical events Prefer wordings avoid yous declare variable `let` style variables **Pronouns** | Recommended ----------- ------------------ Accessibility Disability Emphasize reader underlining inconveniences disabled [approved terminology](https://make.wordpress.org/docs/style-guide/general-guidelines/inclusivity/#accessibility-terminology) specific disabilities Maintain uniform structure important points stylistically visually screen test [List readers](https://en.wikipedia.org/wiki/List_of_screen_readers). multi-platform types devices operating systems Create input voice gesture based controllers mice keyboards ableist pragmatic approach semantics add purely sake matches element group links tables tabular formats span tags rowspan colspan Tables prove difficult readers **Accessibility terminology** terminiology adapted [Writing documentation](https://make.wordpress.org/docs/style-guide/general-guidelines/inclusivity/#accessibility-terminology). people-first CDC's [Communicating People Disabilities](https://www.cdc.gov/ncbddd/disabilityandhealth/materials/factsheets/fs-communicating-with-people.html). --------------------------------------------------------------- ------------------------------------------------------------------ handicapped differently abled challenged abnormal normal healthy able-bodied \\[disability] victim suffering affected stricken unable speak synthetic speech dumb mute deaf low-hearing hearing-impaired blind low-vision vision-impaired visually-challenged cognitive developmental mentally-challenged slow-learner limited mobility physical crippled Samples Choose meaningful cover basics gotchas advanced syntax explain feature works draw circles circle convey idea follow Comments `//` single line Place newline subject comment Put empty block Bad magicWord = Please' Remember Good keyIsPressed === true thing1 note thing2 space easier read //Remember multiline /** */ //Bad /* Whitespace Indent blocks spaces setup ∙∙∙∙createCanvas400 ∙createCanvas400 ∙∙createCanvas400 leading brace setup{ createCanvas400 opening parenthesis control statements `if` `for` argument ifkeyIsPressed doStuff createCanvas operators y=x+5 + Semicolons Yep > JavaScript's [automatic semicolon insertion](https://tc39.github.io/ecma262/#sec-automatic-semicolon-insertion) lead subtle Naming Conventions letter descriptive fx vectorFieldx objects functions instances camelCase OBJEcttsssss {} this_is_my_object thisIsMyObject PascalCase player constructorname thisname Player trailing underscores private properties methods Spy constructorsecret this_secret secret thissecret Variables `var` declared confusing scoping reasonable circlex var throws ReferenceError `const` reason reassigned sketches helpful default flower 🌸' const declaration assignment declarations positions getPositions startSearch dragonball z' Assign place scoped - unnecessary search getCharactername default' character charactersfindc => cname false unary increments decrements `++` `--` Unary increment decrement insertion](https://tc39.github.io/ecma262/#sec-automatic-semicolon-insertion). silent errors incrementing decrementing values expressive update num `+= 1` `num++` num++ --num += -= Strings quotes `''` strings Hilma af Klint template literals interpolation newlines `Hilma Klint` Klint' concatenate characters Broken hard searchable essay \\ simplest convenient definitions' concatenation Template concise provide proper string features Dave' textname conversation serve purpose anymore Goodbye text`${name} Goodbye` unnecessarily escape Backslashes readability bad \\'this\\ \\i\\s \\quoted\\' good Air cool' Boolean Operators `===` `==` `=` shortcuts booleans understand mouseIsPressed == ' collectionlength `switch` parentheses mixing exceptions arithmetic `+` `-` `**` avoids huh && || / Conditionals braces circlemouseX mouseY `else` preceding closing thing3 executes `return` statement mouseIsOnLeft mouseX number letters abc' selection conditionals refrigeratorIsRunning goCatchIt Iteration `while` `do-while` loops iterate fixed times numPetals Pure side effects `forEach` `map` `every` `filter` `find` `findIndex` `reduce` `some` `` arrays `Objectkeys` `Objectvalues` `Objectentries` produce iterating diameters [50 10] circle0 Objects literal creation ball Object quote invalid identifiers improves highlighting engines optimizing performance secretObject x' y' top-secret' classified' dot notation access turtle Leonardo' dodgerblue' weapon 🗡️' food 🍕' turtleName turtle['name'] turtlename bracket `[]` getPropprop turtle[prop] getProp'name' commas mathematician firstName Ada lastName Lovelace Ada' Lovelace' Add comma artist Lauren' McCarthy McCarthy' Arrays array images Array [] [Array#push](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_Objects/Array/push) direct items lyrics lyrics[lyricslength] rough edges smooth' lyricspush'Little `slice` method copy numbersCopy Function foo parameter mutate createBalldiameter diameter put parameters drawSpiralangle length drawSpirallength angle Arrow Functions arrow anonymous Callbacks common creates version context `this` complex rewrite loadImage'assets/moonwalkjpg' img imageimg preload Complex preprocessing processImage processImageimg implicit Omit body returns [1 3]mapnumber squared ** `${number} ${squared}` ${number 2}` include reduces changing Classes `class` manipulating `prototype` directly exception explaining [create libraries]/creating_libraries/ Moverx thisx thisy thisradius Moverprototypeupdate Moverprototyperender circlethisx Mover constructorx render `extends` inheritance RandomMover extends random-1 custom `toString` toString `Mover ${thisx} ${thisy}` constructor delegates parent Dot DragonBall Ball superx numStars thisnumStars duplicate members Duplicate member prefer duplicates means bug thisxspeed thisyspeed reset Assets load assets folder called models project organization required website folders online Examples [src/data/examples/assets](https://github.com/processing/p5.js-website/tree/main/src/data/examples) Reference Pages [src/templates/pages/reference/assets](https://github.com/processing/p5.js-website/tree/main/src/templates/pages/reference/assets) Learn [src/assets/learn](https://github.com/processing/p5.js-website/tree/main/src/assets/learn) loadImage'moonwalkjpg'"},"friendly_error_system":{"relativeUrl":"/contributor-docs/friendly_error_system","description":"🌸 p5js Friendly Error System FES ## Overview aims programmers providing error messages simple friendly language supplements browser's console adding alternative description links helpful references prints window [p5js Web Editor] browser JavaScript single minified file p5 p5minjs omits https://editor.p5js.org/ Lowering Barriers Debugging design tool match people lower barriers debugging exception evaluate existing hear directly ran community survey gather feedback future wishes Errors insights members contributors results summary comic full report * [21-22 Survey Report Comic] Full Report] https://almchung.github.io/p5jsFESsurvey/ https://observablehq.com/@almchung/p5-fes-21-survey Writing Messages contribute library writing translating part [internationalization] effort generate content [i18next]-based `translator` function dynamic message generation languages including English - default contributions world 🌐 https://github.com/processing/p5.js/blob/main/contributor_docs/internationalization.md [i18next] https://www.i18next.com/ #### Practices writers prioritize lowering barrier understanding increasing accessibility process [Friendly i18n Book] discusses challenges practices cross-cultural context points book Understand audience make assumptions learn inclusive strive bias harm Adhere Code Conduct] sentences breaking sentence smaller blocks utilizing i18next's [interpolation] feature Prioritize communication provide great experience Avoid figures speech Introduce technical concept term time consistency link external resource written beginner-friendly plenty short practical examples https://almchung.github.io/p5-fes-i18n-book/ https://www.i18next.com/translation-function/interpolation https://github.com/processing/p5.js/blob/main/CODE_OF_CONDUCT.md#p5js-code-of-conduct [expert blind spots] https://tilt.colostate.edu/TipsAndGuides/Tip/181 public project separate [repo] https://github.com/almchung/p5-fes-i18n-book Location Translation Files based i18next imported `src/core/internationalizationjs` generates text data JSON translation ``` translations/{{detected locale code default=en}}/translationjson detected Korean designator `ko` read translated `translations/ko/translationjson` assemble final include regional information `es-PE` Spanish Peru Structure `translationjson` [format i18next](https://www.i18next.com/misc/json-format). basic format file's item key double quotation marks `` closed curly brackets `{}` ```json { } ASCII logo saved \\n /\\\\| |/\\\\ \\\\ ` / \\\\/|_|\\\\/ \\n\\n supports interpolation pass variable dynamically `{{}}` set placeholder greeting {{who}} `greeting` `who` ```JavaScript translator'greeting' result generated `fes`'s `fileLoadError` demonstrates image problem loading {{suggestion}} call pre-generated `suggestion` translator'fesfileLoadErrorimage' suggestion Add Modify [internationalization doc] step-by-step guide modifying files Understanding Works section give overview displays detailed functions [FES Reference + Dev Notes] https://github.com/processing/p5.js/tree/main/src/core/friendly_errors#fes-reference-and-notes-from-developers calls multiple locations situations throws user API custom cases benefit find core components inside `src/core/friendly_errors` `translations/` Message Generators responsible catching errors generating [`_friendlyFileLoadError`] catches [`_validateParameters`] checks input parameters inline documents \\[`_fesErrorMonitor`] handles global reference [Dev https://github.com/processing/p5.js/blob/main/contributor_docs/fes_reference_dev_notes.md#_friendlyfileloaderror https://github.com/processing/p5.js/blob/main/contributor_docs/fes_reference_dev_notes.md#validateparameters [`_fesErrorMontitor`] https://github.com/processing/p5.js/blob/main/contributor_docs/fes_reference_dev_notes.md#feserrormonitor https://github.com/processing/p5.js/blob/main/contributor_docs/fes_reference_dev_notes.md Displayer `fes_corejs/_friendlyError` p5_friendlyError translator'fesglobalErrorstypenotfunc' translationObj called Turning [disable performance] `p5disableFriendlyErrors` turn `true` p5disableFriendlyErrors = true setup createCanvas100 automatically https://github.com/processing/p5.js/wiki/Optimizing-p5.js-Code-for-Performance#disable-the-friendly-error-system-fes"},"internationalization":{"relativeUrl":"/contributor-docs/internationalization","description":"🌐 Internationalization [Internationalization](https://developer.mozilla.org/docs/Glossary/Internationalization_and_localization) abbreviated i18n refers supporting multiple languages software project means maintaining translations text strings letting users choose translation receive detecting browser settings p5js internationalization bunch areas contributor docs [the official website](https://p5js.org), reference expanding include console output primarily developer-facing error messages efforts ## Tooling integrated [i18next](https://www.i18next.com) codebase un-minified build `p5minjs` includes outer layer code ### Setup set i18next integration `src/core/internationalizationjs` `translations/` engine autodetect user's language p5 sketch initialized ensures errors encounter `setup` `preload` autodetection fall back English #### specific logic browserify task `src/core/initjs` avoid loading setting minified Adding increase size line top file ```js import { translator } /internationalization' ``` Simple log message inline consolelog'Loading now' `translator` consolelogtranslator'sketchloading' tells `sketchloading` detected user prefers Dynamic inject variables translated consolelog'I couldnt find + filename there' consolelogtranslator'fileLoadingnotFound' fileName Translations expect make Check `translations/{YOUR_LANGUAGE}/` variable object path key `fileLoadingnotFound` found ```json fileLoading notFound {{fileName}} Variables framed `{{` `}}` Modifying Simply open `translations/{YOUR_LANGUAGE}/translationjson` edit easiest add de German Italian [locales list](https://github.com/processing/p5.js/blob/84bc1f92c89786f48e5d6fd1045feb649b932eea/package.json#L111-L114) `packagejson` terminal run $ npm build' generate fresh `translations/{LANGUAGE_CODE}/` begin populating 🥖 entry [`translations/indexjs`]/translations/indexjs [`translations/devjs`]/translations/devjs follow pattern `en` `es` Testing bulk included final library hosted online automatically downloaded Updates happen version released simply `npm dev` configured files present locally computer internet Reading [i18next function documentation](https://www.i18next.com/translation-function/essentials). documented subset functionality"},"issue_labels":{"relativeUrl":"/contributor-docs/issue_labels","description":"p5js issue labels set sort organize issues status areas affected ## Status | Label Usage ----------------- -------------------------------------------------------------------- Announcement leads/stewards Bug Dependencies Discussion problem community input determine solution Enhancement improvement codebase Feature Request addition Wanted fix contributors Issue Good Issues recommended time Info Needed Require info illustrate label added Areas part code base Area coordinated [src folder](https://github.com/processing/p5.js/tree/main/src) structure * AreaAccessibility AreaColor AreaCore AreaData AreaDOM AreaEvents AreaImage AreaIO AreaMath AreaTypography AreaUtilities AreaWebGL rest steward [focus areas](https://github.com/processing/p5.js#stewards). Build Process Unit Testing Internalization Friendly Errors Documentation"},"navbar":{"relativeUrl":"/contributor-docs/navbar","description":"{/* _navbarmd */} * [En]/ [Es]/es/ [Pt-Br]/pt-br/ [Ko]/ko/ [Sk]/sk/ [Zh]/zh/ [Hi]/hi/ [Ar]/ar/"},"organization":{"relativeUrl":"/contributor-docs/organization","description":"Organizing Contributions Keeping repository organized ensures clear discussions tasks important helps maintainers contributors navigate overwhelmed set guidelines organize issues work pull requests Helping organization great contribute bug report missing information code feel free chime info issue assignee activity days helpful comment check helping organizational make kind community mind Guidelines Organization ## Issues * **All relevant template** reports include sample code** form posted body link online preferably [the editor](https://editor.p5js.org) labels** makes easier Depending template labels area automatically cases add additional required **Issue assignment first-come first-serve** reproduced feature request/enhancement agreed contributor request assigned unclear reproducible Pull Requests issue** fix start opening discuss opened open Decision-Making p5 aspires decision-making process transparent horizontal informal consensus-seeking model means prefer reach consensus decisions fails vote place **Stewards** ability veto proposals happen proposal align mission/community presents significant maintenance implementation challenge project tackle time propose change large necessitates design consideration discussion label Interested members thoughts period passed urgent discern interest reached approach point close submitted concluded > future automate processes idea bot github action Stewards involved familiar responsive areas role provide context guidance working p5js question contributing tag listed steward weigh guide direction input interested volunteer specific requirements expertise actively learning participating youre parts added steward's username remain [stewards section readme](https://github.com/processing/p5.js#stewards) removed unresponsive extended ping status break back"},"project_wrapups":{"relativeUrl":"/contributor-docs/project_wrapups/yukienomiya_gsoc_2020","description":"i18n improvements Italian translation ## Introduction past months worked improving facilitating internationalization process p5js website guided mentor [Evelyn Masso](https://github.com/outofambit). title project suggests originally planned add coding period Evelyn decided focus prioritize building tool **p5js-website-translator** completion wrote [Design Doc](https://docs.google.com/document/d/1l8-h3fjIS_o7ncG7OJXPwOFA1O3htVjjJ_a_RgxoCxk/edit?usp=sharing) explained reasoning choices future extensions contributions concern [p5.js-website](https://github.com/processing/p5.js-website) [p5.js-website-translator](https://github.com/processing/p5.js-website-translator) repositories Contributions * **[PR #836](https://github.com/processing/p5.js-website/pull/836) - Extended p5js-website render mechanism support Class pages** Reference section displays library documentation Classes Methods Fields [updateLanguage()](https://github.com/processing/p5.js-website/blob/main/src/templates/pages/reference/index.hbs#L61) function responsible swapping original English text website's translated version `updateLanguage` translate Method Field pages description p5 `p5Color` files rendered webpage added extra swaps complete script #837](https://github.com/processing/p5.js-website/pull/837) Developed parses data inline generates files** built JSON file generated repository ([data.json](https://github.com/processing/p5.js-website/blob/main/src/templates/pages/reference/data.json). completely structure compared strings needed made comparing make synced tedious ([en.json](https://github.com/processing/p5.js-website/blob/main/src/data/reference/en.json): #4733](https://github.com/processing/p5.js/pull/4733) Setup GitHub workflow triggers time release published** #841](https://github.com/processing/p5.js-website/pull/841) updates ([data.json](https://github.com/processing/p5.js-website/blob/main/src/templates/pages/reference/data.json)) manually committed published automated Github workflows `update-p5jswebsite` triggered turn update-documentation `update-documentation` runs Grunt task enjson #854](https://github.com/processing/p5.js-website/pull/854) Update existing match PR #837** Added missing elements Converted arrays Saved parameter #856](https://github.com/processing/p5.js-website/pull/856) Created merges keys YAML format removes obsolete keys** Set updateJSON updateYAML functions modified** `updateJSON` `updateYAML` ensures #865](https://github.com/processing/p5.js-website/pull/865) Translated Italian** excluding Examples makes approximately ⅓ **[p5.js-website-translator](https://github.com/processing/p5.js-website-translator) Built Nuxtjs web app simplify contributors** commit [#51a29bd](https://github.com/processing/p5.js-website-translator/commit/51a29bd877ef671f130e53b2aeeeea1f9f7fc788)) automatically fetches offers contributor user-friendly UI easily edit user selected language contribute presented page ![image](https://user-images.githubusercontent.com/49163604/91746243-97b7b700-ebbc-11ea-8572-e94909e9c32f.png) display list cards key string ![image](https://user-images.githubusercontent.com/49163604/91746362-c5046500-ebbc-11ea-8fb2-b904b1444d2f.png) **edit** **compare** edited **restore** deleting p5js-website-translator serverless edits saved browsers local storage editing **download** resulting spares contributors search deal raw experience translating lot content editor inconvenient visually aligning deployed ready check [here](https://processing.github.io/p5.js-website-translator/)! Conclusion mentioned halfway strayed bit plan reason completed sections Nonetheless happy work maintain create technical point view working fun challenging frontend framework means learned slowly due thing taking tons google searches done/features instance option filter simple update latest intend implement features Acknowledgements Processing Foundation giving amazing opportunity summer allowed learn grow step comfort zone treasure forever Lauren McCarthy creating constructive positive welcoming community big Aarón Montoya-Moraga suggestions inspired build Kenneth Lim answering questions providing constant feedback awesome Masso guiding supporting ideas helping develop finally understanding twisted unclear explanations ❤️ friend Simone Primarosa explaining source code meant years ago deploying telling Google Summer Code year believing convince"},"release_process":{"relativeUrl":"/contributor-docs/release_process","description":"Release process ## Approach * follow [semver](https://semver.org/) versioning pattern means `MAJORMINORPATCH` Requirements Git nodejs NPM installed system build library push access remote repository Secret `NPM_TOKEN` set `ACCESS_TOKEN` Security tokens release steps run fully [repository secrets](https://docs.github.com/en/actions/security-guides/encrypted-secrets#creating-encrypted-secrets-for-a-repository) created [here](https://docs.npmjs.com/creating-and-viewing-access-tokens) create read publish token user belongs project personal `p5js` `p5js-website` `p5js-release` repositories generated [here](https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/creating-a-personal-access-token) scopes choose `repo` `workflow` recommended organization specific account limit account's write required Usage ```sh $ git checkout main npm version [major|minor|patch] Choose tag origin v142 Replace number ``` actual GitHub Actions CI Monitor check results commands executed action monitored [Actions tab](https://github.com/processing/p5.js/actions) p5js repo page job clicking give detailed log running [Screenshot job]/images/contributor-docs/release-actionpng completed released Check [release](https://github.com/processing/p5.js/releases) [NPM](https://www.npmjs.com/package/p5) pages latest view draft make changelog website updated deploy relevant page](https://github.com/processing/p5.js-website/actions) desired [Downloads page](https://p5js.org/download/) CDNs bit time day update automatically pull *** happening Action [New release]/github/workflows/releaseyml triggered matches `v***` `npm ___` command Clone setup extract install dependencies `npm` test test` Create files uploaded releases Update Copy `datajson` `dataminjson` location `p5minjs` `p5soundminjs` `datayml` file `enjson` based Commit back Bower libraries principle concentrate place environment step defined workflow part configuration Testing testing difficult [act](https://github.com/nektos/act) locally tested developed require temporary modifications definition roughly document precise change requirements present mocha Chrome tests needed `apt` setting rest eye error messages information packages missing pushing commented avoid accidentally unintended"},"repo_structure":{"relativeUrl":"/contributor-docs/repo_structure","description":"code lives overarching p5js project includes repositories * **[p5.js](https://github.com/processing/p5.js)**: repository source library [user-facing reference manual](https://p5js.org/reference/) generated [JSDoc](https://jsdoc.app/) comments included maintained [Qianqian Ye](https://github.com/qianqianye) group [stewards](https://github.com/processing/p5.js#stewards). **[p5.js-website](https://github.com/processing/p5.js-website)**: [p5js website](http://p5js.org), exception manual Ye](https://github.com/qianqianye), [Kenneth Lim](https://github.com/limzykenneth), [stewards](https://github.com/processing/p5.js-website#stewards). **[p5.js-sound](https://github.com/processing/p5.js-sound)**: p5soundjs [Jason Sigal](https://github.com/therewasaguy). **[p5.js-web-editor](https://github.com/processing/p5.js-web-editor)**: web editor](https://editor.p5js.org). [Cassie Tarakajian](https://github.com/catarak). add-on libraries listed maintainers directly ## Repository File Structure lot files overview confusing understand file started recommend beginning area fixing inline documentation working outwards exploring Luisa Pereira's [Looking Inside p5.js](https://www.luisapereira.net/teaching/materials/processing-foundation) video tour tools workflow 📁`contributor_docs/` documents explain practices principles contributors 📁`docs/` docs *generate* [online manual](https://p5js.org/reference/). 📁`lib/` empty p5sound periodically updated pull request [p5js-sound repository](https://github.com/processing/p5.js-sound). built compiled single [Grunt](https://gruntjs.com/). checked GitHub make 📁`src/` topically organized separated modules work changing folders readmemd inside find 📁`tasks/` scripts perform automated tasks related build deployment release versions 📁`tests/` unit tests ensure continues function correctly made 📁`utils/` additional generally ignore directory Miscellaneous 📁[`contributor_docs/`](https://github.com/processing/p5.js/tree/main/contributor_docs) folder explore pertain contributing specific areas technical non-technical development [This Coding Train](https://youtu.be/Rr3vLyP1Ods) trainrainbow contribution [Docker image](https://github.com/toolness/p5.js-docker) mounted [Docker](https://www.docker.com/) develop requiring installation requirements [Node](https://nodejs.org/) affecting host operating system Docker process generates [JSON data file](https://p5js.org/reference/data.json) public API tooling autocompleting methods editor hosted website part"},"sidebar":{"relativeUrl":"/contributor-docs/sidebar","description":"{/* docs/_sidebarmd */} * [**CONTRIBUTORS INTRO**]README/ [**CONTRIBUTOR GUIDELINES**]contributor_guidelines/ [**STEWARD GUIDELINES**]steward_guidelines/ **CONTRIBUTING DOCS** [Contributing Documentation]contributing_documentation/ [Issue Labels]issue_labels/ THOUGHTS** [Design Principles]design_principles/ [How Contributions Organized]organization/ CODE** [Creating Libraries]creating_libraries/ [Inline Documentation]inline_documentation/ [Unit Testing]unit_testing/ [Friendly-Error System]friendly_error_system/ **RELATED INFO** [Repository Structure]repo_structure/ [WebGL Architecture]webgl_mode_architecture/ [Supported Browsers]supported_browsers/ [Web Accessibility]web_accessibility/ [Custom Builds]custom_p5_build/ [Release Process]release_process/"},"steward_guidelines":{"relativeUrl":"/contributor-docs/steward_guidelines","description":"Steward Guidelines joined steward seasoned maintainer p5js guide information tips tricks effectively contribute written guidelines stated means adapt practices shown suit workflow ## Table Contents * [Issues]steward_guidelinesmd#issues [Bug report]steward_guidelinesmd#bug-report [Feature request]steward_guidelinesmd#feature-request enhancement]steward_guidelinesmd#feature-enhancement [Discussion]steward_guidelinesmd#discussion [Pull Requests]steward_guidelinesmd#pull-requests [Simple fix]steward_guidelinesmd#simple-fix fix]steward_guidelinesmd#bug-fix [New feature/feature enhancement]steward_guidelinesmd#new-feature-feature-enhancement [Dependabot]steward_guidelinesmd#dependabot [Build Process]steward_guidelinesmd#build-process [Main build task]steward_guidelinesmd#main-build-task [Miscellaneous tasks]steward_guidelinesmd#miscellaneous-tasks [Release Process]steward_guidelinesmd#release-process [Tips Tricks]steward_guidelinesmd#tips--tricks [Reply templates]steward_guidelinesmd#reply-templates [GitHub CLI]steward_guidelinesmd#github-cli [Managing notifications]steward_guidelinesmd#managing-notifications *** Issues encourage source code contributions start issue issues place discussions steps reviewing depend kind repo templates](https://github.com/processing/p5.js/blob/main/.github/ISSUE_TEMPLATE) order organize kinds authors provide relevant problems step filled-out template determining additional fields filled incorrect ### Bug report Found bug typical addressing reports Replicate goal reviewer attempt replicate question reported opened p5js-website Transfer access leave comment filed direct link provided close replication replicated discussion required determine fix straightforward tricky refer [p5js design principles]design_principles/ making decision case-by-case basis author Approve fixing leaving assigning cog button side Assignee Leave recognizing replicable Attempt add `help wanted` label signal needing info version browser OS testing environment differs specific Add setup bugs occur web editor locally case redirected [web repo](https://github.com/processing/p5.js-web-editor). back stems user behavior Determine documentation implementation friendly error system improved prevent mistake made Kindly redirect questions [forum](https://discourse.processing.org/) [Discord](https://discord.com/invite/SHQ8dH25r9) Feature request Request feature requests part commitment increase make increases communities historically marginalized field details [here]access/ Increasing Access sufficiently statement member community including reviewers assessed inclusion based criteria fit project scope [design drawing primitive shape considered adopt browser-based IOT protocol narrow avoid excessive bloat rarely features suggest implement addon library unclear fits good idea proof-of-concept helps give users concrete usage importance necessarily complete solution fully integrated core breaking change conflict existing functions variables sketches Features conflicts [major release](https://docs.npmjs.com/about-semantic-versioning), proposed achieved functionalities simple native JavaScript easy-to-use libraries providing function join array strings `join[Hello world]` `[Hello world]join` preferred requirement considerations fulfilled stewards maintainers approve work begin PR review process documented enhancement Existing Enhancement similar difference blurry deals requesting added Similar accepted point [section above]steward_guidelinesmd#feature-request Inclusion enhancements attention paid potential modifying previous valid signatures behave approved Discussion type minimal gather feedback topic general coalescing sorts closed conversation finishes resulting created correct applied removed Additional requested included contribution GitHub repositories/contribution process/contribution forum Discord labels glance Pull Requests repositories happen pull Stewards push encouraged follow > contributing found [here](https://github.com/processing/p5.js/blob/main/.github/PULL_REQUEST_TEMPLATE/). discussed meaning [issue workflow]steward_guidelinesmd#issues reviewed instances apply minor typo fixes require open merged merge area exception exists practice contributors words doubt applies solve referenced edit original post Resolves #OOOO Addresses automatically Simple small directly Check Files Changed tab ensure automated CI test passes [The files changed viewing GitHub]/images/contributor-docs/files-changedpng checks passed indicator highlighted button]/images/contributor-docs/all-checks-passedpng ideally initially implemented tested CLI streamline Tricks]steward_guidelinesmd#tips-tricks [ ] address behaviors agreed significant performance impact accessibility modern standard coding pass tests include line comments lines [here](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/reviewing-changes-in-pull-requests/commenting-on-a-pull-request#adding-line-comments-to-a-pull-request). suggestion block changes\\ Suggest Change writing request]/images/contributor-docs/suggest-changepng\\ [A suggested appearing fences tag]/images/contributor-docs/suggested-value-changepng\\ previewed diff]/images/contributor-docs/suggestion-previewpng multiple dont single-line times procedure [here](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/reviewing-changes-in-pull-requests/reviewing-proposed-changes-in-a-pull-request) multiple-line single clarification choose Comment option circled Finish Review menu]/images/contributor-docs/comment-reviewpng mark Approved choosing desired @[all-contributors](https://allcontributors.org/docs/en/emoji-key) bot called list READMEmd file `[contribution` `type]` full types `@all-contributors` `please` `add` `@[GitHub` `handle]` `for` notable Dependabot PRs visible admins skip section update [semver](https://semver.org/) patch semver long quick check changelog updated dependency recommended major affect current target processes functioning due dependencies bump numbers drop official support versions Nodejs cases API Build cover commands happening scenes [contributors guidelines]contributor_guidelinesmd#working-on-p5js-codebase detailed Gruntfilejs main definitions tools includes limited Grunt Browserify YUIDoc ESLint Babel Uglify Mocha helpful `default` task backward document explainer Main ``` gruntregisterTask'default' ['lint' test'] run `grunt` npm script `npm test` default consisting `lint` `test` #### Task gruntregisterTask'lint' ['lintsource' lintsamples'] consists tasks `lintsource` `lintsamples` subdivided `eslintbuild` `eslintsource` `eslinttest` scripts `yui` `yuidocprod` `cleanreference` `minjson` extract JSON remove unused minify generated `dataminjson` `eslint-samplessource` custom definition [/tasks/build/eslint-samplesjs]tasks/build/eslint-samplesjs convention rest built lint examples ```js gruntregisterTask'test' build' connectserver' mochaChrome' mochaTest' nycreport `build` gruntregisterTask'build' browserify' browserifymin' uglify' browserifytest Tasks `browserify` defined [/tasks/build/browserifyjs]tasks/build/browserifyjs differences builds `browserifymin` intermediate minified data needed FES `uglify` takes output final p5minjs configuration `browserifytest` building identical coverage reporting [Istanbul](https://istanbul.js.org/)). `fsreadFileSync` nodejs replaced file's actual content `brfs-babel` WebGL inline shader separate node\\_modules transpiled match [Browserslist](https://browsersl.ist/) packagejson ES6 import statements CommonJS `require` browserify understands enables newer syntax worrying compatibility bundling bundled `pretty-fast` meant cleaned formatting bit consistent anticipate read inspected left linked closer connectserver spins local server hosting Chrome mochaChrome [/tasks/test/mocha-chromejs]tasks/test/mocha-chromejs Puppeteer spin headless remote controlled runs HTML `/test` folder unminified unit suites reference mochaTest `mochaChrome` subset set expanded Finally print console Test monitoring points 100% covers Miscellaneous `npx grunt [step]` covered yuidev spinning serves functionally page find website [http://localhost:9001/docs/reference/](http://localhost:9001/docs/reference/). monitor rebuild `yuidev` working move repository time preview slightly simplified confident show correctly Note modifications styling layout watch watchmain watchquick series thing `watch` running detecting `watchmain` `watchquick` Depending save manually Release [release\\_processmd]release_process/ Tips number overwhelming put things easier utilize Reply templates handy [Saved Replies](https://docs.github.com/en/get-started/writing-on-github/working-with-saved-replies/about-saved-replies) authoring reply responding replies redirecting accepting Saved Replies efficient create ##### Closing Reproduce reproduce feel free reopen sample demonstrates Snippet closing organizational purposes snippet illustrates Forum tutorials GSOC discuss proposals [forum](https://discourse.processing.org/c/summer-of-code). lot interest clear explanation [expands access]access/ Addon great starting docs [https://github.com/processing/p5.js/blob/main/contributor\\_docs/creating\\_libraries.md](creating_libraries/) Issue reminder tagged tracking development keeping ahead Merged Reviewing complex difficult git PR's Fortunately CLI](https://cli.github.com/) tool greatly installing logging command `gh pr checkout [pull_request_id]` fetching fork creating branch checking switching `git main` visit webpage Managing notifications tabs clicking Watch eye icon top opposite [Cropped screenshot corner showing buttons center Sponsor Fork Starred]/images/contributor-docs/github-repo-metricspng watching events mentions handle activities subscribed [notification page](https://github.com/notifications), marked dismissed email inbox receive emails customize unsubscribing completely [notifications settings page](https://github.com/settings/notifications). Setting issues/PRs overwhelmed endless balance Participating @mentions"},"supported_browsers":{"relativeUrl":"/contributor-docs/supported_browsers","description":"Supported browsers ## stated goal p5js [browserslist](https://browsersl.ist/) [Babel](https://babeljs.io/) provide support older browserslist configuration [`last versions dead`](https://browserslist.dev/?q=bGFzdCAyIHZlcnNpb25zLCBub3QgZGVhZA%3D%3D). `last versions` means releases `not dead` official updates past months conditions true browser supported practice latest features Javascript Babel transpile polyfill matching required compatibility list [Web API](https://developer.mozilla.org/en-US/docs/Web/API), [WebGL](https://developer.mozilla.org/en-US/docs/Web/API/WebGL_API), similar part core language handled assessed case basis Good places check feature [caniuse.com](https://caniuse.com/) [MDN](https://developer.mozilla.org/en-US/). apply requirement source code examples website page documentation tutorials party add-on libraries adhere encouraged cases officially work guarantee Stewards section responsible ensuring PR involving"},"unit_testing":{"relativeUrl":"/contributor-docs/unit_testing","description":"Unit Testing testing essential part large codebase stay bug-free tests small pieces code aim test individual components larger base correctness making function class creating object instances correctly p5js unit ensure functions librarys introduce bugs unexpected behavior called regression Tests run `npm test` command terminal guide walk process writing implementing adding feature existing changing implement relevant ## Prerequisites * foundation Contributor guidelines local development setup inside Files folders test-related files located `test` folder wont focus `unit` subfolder subfolders roughly correspond `src` source time counterpart composed modules module public frameworks [Mocha](https://mochajs.org) runner responsible running providing solid framework reporting results long output Mocha doesnt assertion library collection handy lets properties values equal type throws error [Chai's `assert` `expect`)](https://www.chaijs.com/api/assert/) write statements behave Writing start pick variable Lets `p5prototypekeyIsPressed` beginning understand expected *expected behavior* `keyIsPressed` `true` key pressed `false` keys cases boolean - alphabet number special multiple `suite` built-in provided environment file `test/unit/events/keyboardjs` find additional `setup` `teardown` describes case checks single feature/behavior tested argument passed description suite/test purpose give clear suite press ```js suite'p5prototypekeyIsPressed' { test'keyIsPressed boolean' //write } true press' false pressed' ``` structured written Chai's `myp5` defined top section callback creates instance mode sketch myp5 setupfunctiondone p5functionp psetup = `p` parameter access variables assigned functionalities Remember previously mentioned Chai //Asserts assertisBooleanmyp5keyIsPressed create actual practice means condition similar statement throw Chais `assertisBoolean` check `myp5keyIsPressed` [documentation](https://www.chaijs.com/api/assert/) kinds things method behaves correct Adding add component Generally path `test/unit` `src/color/p5Colorjs` `test/unit/color/p5Colorjs` added make copy rename match delete inserting keeping teardown suite'module_name' myID myCanvasID' cnv pcreateCanvas100 cnvidmyID teardownfunction myp5remove `spec` `test/unit/specjs` loaded // test/unit/specjs var spec typography ['attributes' loadFont' p5Font' yourModule'] grouped representing function/variable expand suite'p5prototypeyourFunction' test'should [test something]' assertions suites needed didnt Conventions conventions practices follow `test`s self-contained rely Test minimal thing accepts arguments Prefer `expect` Running straightforward takes simply bit repetitive tricks streamline `npx grunt watchmain` automatically build save manually frequent mark skipped `skip` `only` syntax suiteskip'p5prototypeyourFunction' suiteonly'p5prototypeyourFunction' `grunt yuidev` launch server reference live [`http://127.0.0.1:9001/test/test.html`](http://127.0.0.1:9001/test/test.html) browser debugger middle log complex objects filter search term `grep=` URL [`http://127.0.0.1:9001/test/test.html?grep=framebuffer`](http://127.0.0.1:9001/test/test.html?grep=framebuffer) Visual sketches unexpectedly change implementation features visual lives `test/unit/visual/cases` Inside sample calls `screenshot` visualTest'2D maintain size' functionp5 screenshot p5createCanvas50 p5WEBGL p5noStroke p5fill'red' p5rectModep5CENTER p5rect0 p5width/2 p5height/2 filename list `test/visual/visualTestListjs` Additionally continuous integration pull request `visual` generate screenshots intentionally matching `test/unit/visual/screenshots` re-run inspect [http://127.0.0.1:9001/test/visual.html](http://127.0.0.1:9001/test/visual.html) CI optimizing speed advantageous concise avoid unnecessary frames minimize canvas size load assets specific functionality address scenarios involving operations asynchronous 3D model rendering returning promise resolves completing ensuring efficiency approach visualSuite'3D Model rendering' visualTest'OBJ displayed correctly' Return Promise waits operation complete return Promiseresolve => Load asynchronously p5loadModel'unit/assets/teapotobj' p5background200 p5rotateX10 p5rotateY10 p5modelmodel comparison Resolve completion resolve"},"web_accessibility":{"relativeUrl":"/contributor-docs/web_accessibility","description":"p5js Web Accessibility document describes structure web accessibility features contributors make sketches [screen reader](https://en.wikipedia.org/wiki/Screen_reader)-accessible, visit label code tutorial screen reader [Using Screen Reader tutorial](https://p5js.org/learn/p5-screen-reader.html). canvas HTML element grid pixels doesnt provide reader-accessible information shapes drawn functions accessible readers providing [fallback text](https://developer.mozilla.org/en-US/docs/Web/API/Canvas_API/Tutorial/Basic_usage#accessible_content) descriptions Ill describe details implementation ## Prerequisites * foundation Contributor guidelines local development setup inside Library-generated outputs basic supports library-generated `textOutput` `gridOutput` user-generated `describe` `describeElement` inserted child elements `` work snippet serve ```js function { createCanvas400 } draw background#ccccff textOutput fillorange ellipse100 fillfuchsia rect300 ``` [An orange circle pink square light purple canvas]/images/contributor-docs/sketch-with-shapespng creates output present general description includes size color number > lavender blue list position area shape top left covering 1% canvas\\ fuchsia bottom 2% selected table provided location coordinates location=top area=1%\\ = generates ```html Text Output white lays content form based spatial background objects object types cell depending type circle\\ individually *orange %* *fuchsia generated Grid % user passes `LABEL` argument additional created \\ visible version embedded non-screen users display create unnecessary redundancy recommend part process sketch removing publishing sharing [A text earlier it]/images/contributor-docs/sketch-text-outputpng ### Outputs located [src/accessibility/outputs.js](https://github.com/processing/p5.js/blob/main/src/accessibility/outputs.js), updated distributed library section support #### outputsjs [src/accessibility/outputs.js](https://github.com/processing/p5.js/blob/main/src/accessibility/outputs.js) public methods activate setting `this_accessibleOutputstext` `this_accessibleOutputsgrid `to `true` calling `this_createOutput'textOutput' Fallback'` `this_createOutput'gridOutput' passed parameter method activates `this_accessibleOutputstextLabel` calls Label'` file private `_createOutput` Depending vary initializes `thisingredients` stores data including `shapes` `colors` `pShapes` string previous `thisdummyDOM` exist HTMLCollection DOM `_updateAccsOutput` called end `setup` `draw` accessibleOutputs differs current update `_updateTextOutput` `_updateGridOutput` Calling ingredients helps avoid overwhelming access divs constantly updating `_addAccsOutput` `this_accessibleOutputs` returns true `this_accessibleOutputsgrid` `_accsBackground` `background` resets `thisingredientsshapes` `this_rgbColorName` store `thisingredientscolorsbackground` `_accsCanvasColors` fill stroke updates colors saving `thisingredientscolorsfill` `thisingredientscolorsstroke` names `_accsOutput` Builds creating src/accessibility call helper gather needed include `_getMiddle` Returns middle point centroid rectangles arcs ellipses triangles quadrilaterals `_getPos` left' mid right' `_canvasLocator` 10\\*10 mapped `_getArea` percentage total outputjs `p5prototypetriangle` `p5prototype_renderRect` `p5prototypequad` `p5prototypepoint` `p5prototypeline` `p5prototype_renderEllipse` `p5prototypearc` `p5prototyperedraw` `p5prototyperesizeCanvas` `this_setup` `p5Renderer2Dprototypestroke` `p5Renderer2Dprototypefill` `p5Renderer2Dprototypebackground` textOutputjs [src/accessibility/textOutput.js](https://github.com/processing/p5.js/blob/main/src/accessibility/textOutput.js) main build summary Building supported `p5` prototype `_textSummary` `_shapeDetails` `_shapeList` gridOutputjs [src/accessibility/gridOutput.js](https://github.com/processing/p5.js/blob/main/src/accessibility/gridOutput.js) `this_accessibleOutputsgridLabel` maps `_gridSummary` `_gridMap` `_gridShapeDetails` line color\\_namerjs naming important [src/accessibility/color\\_namer.js](https://github.com/processing/p5.js/blob/main/src/accessibility/color_namer.js) `_rgbColorName` receives RGBA values [src/accessibility/outputs.js](https://github.com/processing/p5.js/blob/main/src/accessibility/outputs.js). `p5color_conversion_rgbaToHSBA` HSV `_calculateColor` [colorNamer.js](https://github.com/MathuraMG/color-namer), developed [2018 Processing Foundation fellowship](https://medium.com/processing-foundation/making-p5-js-accessible-e2ce366e05a0) consultation blind expert comparing stored `colorLookUp` array returning closest User-generated author-defined optional determines displayed [src/accessibility/describe.js](https://github.com/processing/p5.js/blob/main/src/accessibility/describe.js): `_descriptionText` Checks `FALLBACK` ensures ends punctuation mark ' adds improve readability `_describeHTML` Creates fallback tag adjacent background'pink' fill'red' noStroke circle67 circle83 triangle91 describe'A red heart bottom-right corner' LABEL page reading corner]/images/contributor-docs/sketch-text-output2png describeElement groups meaning custom-drawn made multiple lines Heart corner `_elementName` checks colon character `_describeElementHTML` div describeElement'Heart' circle666 circle832 triangle912 yellow background' corner]/images/contributor-docs/sketch-text-output3png"},"webgl_contribution_guide":{"relativeUrl":"/contributor-docs/webgl_contribution_guide","description":"WebGL Contribution Guide reading page interested helping work mode grateful exists explain structure contributions offer tips making ## Resources * Read [p5js architecture overview]webgl_mode_architecture/ understand differs 2D valuable reference implementation specifics shaders strokes [contributor guidelines](https://p5js.org/contributor-docs/#/./contributor_guidelines) information create issues set codebase test helpful bit browser's API p5js's built top [WebGL fundamentals](https://webglfundamentals.org/) core rendering concepts [The Book Shaders](https://thebookofshaders.com/) explains techniques Planning organize open [in GitHub Project](https://github.com/orgs/processing/projects/5), divide types **System-level changes** longer-term goals far-reaching implications code require discussion planning jumping **Bugs solution yet** bug reports debugging narrow ready fixed found discuss fix solutions PR** bugs decided free write **Minor enhancements** features obvious spot current needing fit agreed worth **2D features** exist p5js expected behavior feature implemented match user requirements clear **Features contexts** ways methods coordinates 3D break generally begin working **Feature requests** change requests make things mode's roadmap **Documentation** documentation Put Code related `src/webgl` subdirectory directory top-level functions split files based subject area commands light `lightingjs` materials `materialsjs` implementing user-facing classes file class occasionally internal utility `p5Framebufferjs` includes `p5Framebuffer` additionally consists framebuffer-specific subclasses main `p5RendererGL` large handles lot reason functionality description put #### `p5RendererGLjs` Initialization `p5RendererGLImmediatejs` Functionality **immediate mode** drawing shapes stored reused `beginShape` `endShape` `p5RendererGLRetainedjs` **retained reuse `sphere` `materialjs` Management blend modes `3d_primitivesjs` User-facing draw `triangle` define geometry treating input generic shape `Textjs` text Testing ### Consistency hard manually verify add unit tests confident pass adding works check consistency resulting pixels ```js test'coplanar 2D' function { const getColors = functionmode myp5createCanvas20 myp5pixelDensity1 myp5background255 myp5strokeCapmyp5SQUARE myp5strokeJoinmyp5MITER === myp5WEBGL myp5translate-myp5width/2 -myp5height/2 } myp5stroke'black' myp5strokeWeight4 myp5fill'red' myp5rect10 myp5fill'blue' myp5rect0 myp5loadPixels return [myp5pixels] assertdeepEqualgetColorsmyp5P2D getColorsmyp5WEBGL ``` turn antialiasing slightly straight lines axes WebGL-only comparing ensure color expect day robust system compares full image snapshots results pixel test'color interpolation' renderer myp5createCanvas256 // upper lower center myp5beginShape myp5fill200 myp5vertex-128 -128 myp5vertex128 myp5fill0 myp5endShapemyp5CLOSE assertequalrenderer_useVertexColor true assertdeepEqualmyp5get128 [100 255] Performance #1 concern hit performance Typically creating sketches compare frame rates advice measure Disable friendly errors `p5disableFriendlyErrors true` sketch `p5minjs` include error Display average rate sense steady state frameRateP avgFrameRates [] frameRateSum numSamples setup createP frameRatePposition0 frameRate / avgFrameRatespushrate += avgFrameRateslength > -= avgFrameRatesshift frameRatePhtmlroundframeRateSum + avg fps' cases stress parts pipeline complicated model long curve simple `line` called times loop"},"webgl_mode_architecture":{"relativeUrl":"/contributor-docs/webgl_mode_architecture","description":"p5js WebGL Mode Architecture document intended contributors library makers extend codebase mode sketches reading tutorials [on Learn page](https://p5js.org/learn/) ## renderers run 2D user make [WebGL API](https://developer.mozilla.org/en-US/docs/Web/API/WebGL_API) built web browser rendering high-performance 3D graphics key difference direct access computer's GPU allowing performantly render shapes perform image processing tasks track progress issues [a GitHub Project.](https://github.com/orgs/processing/projects/20) Goals evaluating feature aligns goals **Features beginner friendly** provide **beginner-friendly introduction WebGL** features offers means offer simple APIs cameras lighting shaders support advanced interfere simplicity core **Improving parity mode** **frictionless transition making click easily users create work shader aims superset mode's **Simplicity Extensibility paramount** **have small extensible libraries** Keeping makes easier optimize reduce bug surface area Extension avenue include libraries **Improve performance** **run fast interfering previous goals** Good performance accessible wide variety viewers devices designing ensure design performant implementation give preference Design Differences browser's canvas context levels abstraction generally lower-level higher-level motivates fundamental differences p5js's modes * **WebGL creates deeply nested data structures** passes commands leading shallow call stacks contrast responsible breaking triangles caching future reuse complicated logic necessitates splitting code number classes `p5Texture` `p5RenderBuffer` `p5DataArray` implementations readable maintainable customization** control curves rendered converting picks default `curveDetail` API lets line segments predict balance quality case high- low-level APIs** finer-grained faced task picking level high unable advantage low pass managing complexity Drawing Shapes ### Creating Fills Strokes Geometry drawn consists fills strokes draw shape ready component webGL composed calls function `circle` `beginShape` `vertex` renderer [break series points](https://github.com/processing/p5.js/blob/main/src/webgl/3d_primitives.js). points connected lines trigonometry figure place circle `curveVertex` `bezierVertex` look-up tables turn Bezier curve #### outline filled drawing functions `beginShapeTRIANGLE_STRIP` made [libtess](https://github.com/brendankenny/libtess.js/) break [p5.RendererGL.Immediate.js](https://github.com/processing/p5.js/blob/main/src/webgl/p5.RendererGL.Immediate.js), polygon outlines `_processVertices` libtess turns format screen varying widths styles expand centers form Expansion types joins caps illustrated {/* Generated https://codepen.io/davepvm/pen/ZEVdppQ */} connect add join miter extends edges rectangles intersect point bevel connects corners straight round circular arc switching recompute quad extent bounds display pixels present selected style illustrate fits similar strategy stroke disconnected ends cap square extended determines calculated change based camera's perspective avoid recalculation store information camera-dependent **center line** model space shown red **direction tangent start end blue pink helps compute **a flag uniquely identifies corner shape** Combined normal 90-degree rotation determine direction thickness combine camera intrinsics produce final positions Rendering Retained Modes routes **immediate **retained **Immediate optimized frame time drew spend storing saves memory variations `quadraticVertex` called `endShape` `rect` rounded `bezier` `curve` `line` `image` redrawing dont retained re-triangulating sending saved p5Geometry object stores triangle uploaded buffers Calling `freeGeometry` clears re-upload `sphere` `cone` internally buildGeometry runs collects returns redrawn efficiently Materials Lights Shaders single pick write materials system lights scene reacts light including color shininess Custom material behavior P5 **Color Shader** flat colors activated `fill` `stroke` **Lighting complex textures Activated calling `lights` `ambientLight` `directionalLight` `pointLight` `spotLight` adds list added contribute shading fill **Normal/Debug `normalMaterial` Users set parameters position contributes view-independent view-dependent reflections reflection matches desired setting `specularColor` **color shader** properties **Fill color** Set applies `beginShape`/`endShape` apply vertex texture `texture` override mixed diffuse describes bright dark areas due directly cast **Specular material** specular reflected highlights shape's parameter `specularMaterial` unspecified **Shininess** `shininess` sharp **Ambient ambient Ambient constant omnidirectional `ambientMaterial` **Emissive `emissiveMaterial` producing Shader Implementation turned attributes uniforms reference custom supply automatically writers unclear Future section describe plans improving improve publicly documenting supporting Global objects contexts global `uniform mat4 uModelViewMatrix` matrix convert object-space camera-space uProjectionMatrix` mat3 uNormalMatrix` normals Additionally per-vertex `attribute vec3 aPosition` aNormal` pointing outward vec2 aTexCoord` coordinate referring location aVertexColor` optional bool uUseLighting` provided `uUseLighting` passed ##### int uAmbientLightCount` maximum uAmbientColor[5]` Directional uDirectionalLightCount` directional uLightingDirection[5]` Light directions uDirectionalDiffuseColors[5]` uDirectionalSpecularColors[5]` Point uPointLightCount` uPointLightLocation[5]` Locations uPointLightDiffuseColors[5]` Diffuse uPointLightSpecularColors[5]` Specular Spot uSpotLightCount` spot float uSpotLightAngle[5]` cone radii uSpotLightConc[5]` Concentration focus uSpotLightDiffuseColors[5]` uSpotLightSpecularColors[5]` uSpotLightLocation[5]` locations uSpotLightDirection[5]` Fill vec4 uMaterialColor` uUseVertexColor` Per-vertex isTexture` sampler2D uSampler` uTint` tint multiplier uSpecular` show uShininess` uSpecularMatColor` blend uHasSetAmbient` uAmbientMatColor` inputs Lines supplied uViewport` vector `[minX minY maxX maxY]` rectangle uPerspective` boolean projection uStrokeJoin` enum representing represent `ROUND` `MITER` `BEVEL` uStrokeCap` `PROJECT` `SQUARE` aTangentIn` segment aTangentOut` aSide` part details Points uPointSize` radius Classes entrypoint **p5RendererGL** Top-level current conform common interface split **p5RendererGLImmediatejs** **p5RendererGLRetainedjs** references models stored **retainedModegeometry** map **p5Geometry** modelyourGeometry entry geometry's resources main p5Graphics entries represented **p5Shader** shaderyourShader class handles compiling source uniform type p5Texture p5Image p5MediaElement p5Framebuffer asset data's representation send images manually updated assets changed video Textures **p5Framebuffer** unique Framebuffers surfaces Unlike framebuffers live transferred CPU bottleneck framebuffer extra transfer p5Framebuffers reason functional aim building blocks craft extensions block considered confidently commit major milestone sufficient ecosystem lacking extension geometry **Extend richer content** accomplish supported stable update animated gltf group multiple imported unsupported **Enable brittle shaders** integrates forced scratch copy paste parts versions internal naming structure import pieces positioning augment [an issue open task.](https://github.com/processing/p5.js/issues/6144) strike method introduce tune output faster lower-quality Line bottlenecks state benefit lower fidelity higher options methods usage patterns `endShapeshouldClose count` supports instanced efficient"}},"examples-fallback":{"Coordinates":{"relativeUrl":"examples/structure-coordinates","description":"shapes drawn screen position coordinate coordinates measured distance origin units pixels \\[0 0] upper left window lower \\[width-1 height-1]"},"Width and Height":{"relativeUrl":"examples/structure-width-and-height","description":"width height variables display window defined createCanvas function"},"Setup and Draw":{"relativeUrl":"examples/structure-setup-and-draw","description":"code inside draw function runs continuously top bottom program stopped setup run starts"},"No Loop":{"relativeUrl":"examples/structure-no-loop","description":"noLoop function draw execute calling code inside run continually"},"Loop":{"relativeUrl":"examples/structure-loop","description":"noLoop run setup code draw click mouse loop function continuously"},"Redraw":{"relativeUrl":"examples/structure-redraw","description":"redraw function makes draw execute executed time mouse clicked"},"Functions":{"relativeUrl":"examples/structure-functions","description":"drawTarget function makes easy draw distinct targets call specifies position size number rings target"},"Recursion":{"relativeUrl":"examples/structure-recursion","description":"demonstration recursion means functions call recursive function terminating condition infinite loop Notice drawCircle calls end block continues variable level equal"},"Create Graphics":{"relativeUrl":"examples/structure-create-graphics","description":"Creates returns p5Renderer object class draw off-screen graphics buffer parameters define width height pixels"},"Points and Lines":{"relativeUrl":"examples/form-points-and-lines","description":"Points lines draw basic geometry Change variable scale form variables set positions based d'"},"Shape Primitives":{"relativeUrl":"examples/form-shape-primitives","description":"basic shape primitive functions triangle rect quad ellipse arc Squares made circles requires number parameters determine shape's position size"},"Pie Chart":{"relativeUrl":"examples/form-pie-chart","description":"arc function generate pie chart data stored array"},"Regular Polygon":{"relativeUrl":"examples/form-regular-polygon","description":"favorite Pentagon Hexagon Heptagon icosagon polygon function created capable drawing regular placing numbers calls draw explore"},"Star":{"relativeUrl":"examples/form-star","description":"star function created capable drawing wide range forms placing numbers calls draw explore"},"Triangle Strip":{"relativeUrl":"examples/form-triangle-strip","description":"Ira Greenberg Generate closed ring vertex function beginShapeTRIANGLE\\_STRIP mode outsideRadius insideRadius variables control ring's radii"},"Bezier":{"relativeUrl":"examples/form-bezier","description":"parameters bezier function point curve middle set control points define shape"},"3D Primitives":{"relativeUrl":"examples/form-3d-primitives","description":"Placing mathematically 3D objects synthetic space box sphere functions parameter size shapes positioned translate function"},"Variables":{"relativeUrl":"examples/data-variables","description":"Variables storing values change variables affect composition"},"True and False":{"relativeUrl":"examples/data-true-and-false","description":"Boolean variable values true false common Booleans control statements determine flow program boolean vertical lines drawn horizontal"},"Variable Scope":{"relativeUrl":"examples/data-variable-scope","description":"Variables global function scope variables declared setup draw functions Global program variable make calculations current"},"Numbers":{"relativeUrl":"examples/data-numbers","description":"Numbers written decimals integer commonly called int number decimal point float floating-point means place"},"Array":{"relativeUrl":"examples/arrays-array","description":"array list data piece identified index number representing position Arrays based means element \\[0] \\[1] named coswave created filled cosine values displayed separate ways screen"},"Array 2D":{"relativeUrl":"examples/arrays-array-2d","description":"Demonstrates syntax creating two-dimensional 2D array Values accessed index values arrays storing images dot colored relation distance center image"},"Array Objects":{"relativeUrl":"examples/arrays-array-objects","description":"Demonstrates syntax creating array custom objects"},"Walk Over 2d Array":{"relativeUrl":"examples/arrays-walk-over-2darray","description":"contributed [Prof WM Harris](https://www.rit.edu/directory/wmhics-w-michelle-harris), display 2D array contents canvas regular for-of loops multiple ways function created Friend Array initialized walked nested Variables place item form final loop initialize Fish random Integers fish ages"},"Iteration":{"relativeUrl":"examples/control-iteration","description":"Iteration structure construct repetitive forms"},"Embedded Iteration":{"relativeUrl":"examples/control-embedded-iteration","description":"Embedding structures repetition dimensions"},"Conditionals 1":{"relativeUrl":"examples/control-conditionals-1","description":"Conditions questions program decide action answer question true false asked logical relational statements variable equal draw line"},"Conditionals 2":{"relativeUrl":"examples/control-conditionals-2","description":"extend language conditionals previous adding keyword sequential questions action"},"Logical Operators":{"relativeUrl":"examples/control-logical-operators","description":"logical operators && || combine simple relational statements complex expressions operator negate boolean statement"},"Load and Display Image":{"relativeUrl":"examples/image-load-and-display-image","description":"Images loaded displayed screen actual size run locally image file running local server"},"Background Image":{"relativeUrl":"examples/image-background-image","description":"presents fastest load background image width height program run locally file running local server"},"Transparency":{"relativeUrl":"examples/image-transparency","description":"Move pointer left image change position program overlays modifying alpha tint function run locally file running local server"},"Alpha Mask":{"relativeUrl":"examples/image-alpha-mask","description":"Loads mask image transparency parts images blended method p5Image run locally files running local server"},"Create Image":{"relativeUrl":"examples/image-create-image","description":"createImage function fresh buffer pixels play creates image gradient"},"Pointillism":{"relativeUrl":"examples/image-pointillism","description":"Dan Shiffman Mouse horizontal location controls size dots Creates simple pointillist effect ellipses colored pixels image run locally file running local server"},"Convolution":{"relativeUrl":"examples/image-convolution","description":"Applies convolution matrix portion image Move mouse apply filter parts port Dan Shiffman's Processing Original comments written run locally file running local server"},"Copy() method":{"relativeUrl":"examples/image-copy-method","description":"simulate coloring image copy method"},"Pixel Array":{"relativeUrl":"examples/image-processing- pixel-array","description":"Click drag mouse control signal press hold key current pixel read program sequentially reads color image displays fill window"},"Histogram":{"relativeUrl":"examples/image-processing- histogram","description":"Calculates histogram image frequency distribution gray levels number pure black values displayed left white Note sketch behave differently Android images longer full 24-bit color"},"Hue":{"relativeUrl":"examples/color-hue","description":"Hue attribute color virtue perceptible red green blue independent saturationintensity brightness"},"Saturation":{"relativeUrl":"examples/color-saturation","description":"Saturation strength purity color represents amount gray proportion hue saturated pure unsaturated large percentage"},"Brightness":{"relativeUrl":"examples/color-brightness","description":"Lightness amount black white mixed hue Adding makes color lighter adding darker"},"Color Wheel":{"relativeUrl":"examples/color-color-wheel","description":"color wheel organization hues circle shows relationships primary colors secondary tertiary"},"Color Variables":{"relativeUrl":"examples/color-color-variables","description":"Homage Albers creates variables colors referred program number"},"Relativity":{"relativeUrl":"examples/color-relativity","description":"color perceived relation colors top bottom bars component display order individual differently"},"Linear Gradient":{"relativeUrl":"examples/color-linear-gradient","description":"lerpColor function interpolating colors"},"Radial Gradient":{"relativeUrl":"examples/color-radial-gradient","description":"Draws series concentric circles create gradient color"},"Lerp Color":{"relativeUrl":"examples/color-lerp-color","description":"Lerp Color blends colors produce range exist chosen color values"},"Increment Decrement":{"relativeUrl":"examples/math-incrementdecrement","description":"Writing a++ equivalent = + a-- -"},"Operator Precedence":{"relativeUrl":"examples/math-operatorprecedence","description":"explicitly state order expression evaluated based operator precedence statement 4+2*8 multiplied result added * higher + avoid ambiguity reading program recommended written 4+2\\*8 evaluation controlled placement parenthesis code table"},"Distance 1D":{"relativeUrl":"examples/math-distance1d","description":"Move mouse left control speed direction moving shapes"},"Distance 2D":{"relativeUrl":"examples/math-distance2d","description":"Move mouse image obscure reveal matrix Measures distance circle sets size proportionally"},"Sine":{"relativeUrl":"examples/math-sine","description":"Smoothly scaling size sin function"},"Sine Cosine":{"relativeUrl":"examples/math-sincosine","description":"Linear movement sin cos Numbers 2π angles roughly put functions numbers -1 returned values scaled produce larger movements"},"Sine Wave":{"relativeUrl":"examples/math-sinewave","description":"Render simple sine wave Original Daniel Shiffman"},"Additive Wave":{"relativeUrl":"examples/math-additivewave","description":"Create complex wave adding waves Original Daniel Shiffman"},"PolarToCartesian":{"relativeUrl":"examples/math-polartocartesian","description":"Convert polar coordinate rθ cartesian xy = cosθ sinθ Original Daniel Shiffman"},"Linear Interpolation":{"relativeUrl":"examples/math-interpolate","description":"Move mouse screen symbol follow drawing frame animation ellipse moves part distance current position cursor lerp function Easing input"},"Double Random":{"relativeUrl":"examples/math-doublerandom","description":"random calls point function create irregular sawtooth line Original Ira Greenberg"},"Random":{"relativeUrl":"examples/math-random","description":"Random numbers create basis image time program loaded result"},"Noise1D":{"relativeUrl":"examples/math-noise1d","description":"1D Perlin Noise assign location"},"Noise Wave":{"relativeUrl":"examples/math-noisewave","description":"Perlin Noise generate wave-like pattern Original Daniel Shiffman"},"Noise2D":{"relativeUrl":"examples/math-noise2d","description":"Create 2D noise parameters"},"Noise3D":{"relativeUrl":"examples/math-noise3d","description":"3D noise create simple animated texture"},"Random Chords":{"relativeUrl":"examples/math-randomchords","description":"Accumulates random chords circle chord translucent accumulate give illusion shaded sphere Contributed Aatish Bhatia inspired Anders Hoff"},"Map":{"relativeUrl":"examples/math-map","description":"map function number scale project working numbers mouse position control size color shape mouses x-coordinate scaled define circle"},"Graphing 2D Equations":{"relativeUrl":"examples/math-graphing2dequations","description":"Graphics equation sinn cosr + 5θ function horizontal mouse location Original Daniel Shiffman"},"Parametric Equations":{"relativeUrl":"examples/math-parametricequation","description":"parametric equation coordinates written terms letter called parameter θ inspiration YouTube channel Alexander Miller"},"Trigonometry and Particles":{"relativeUrl":"examples/math-trigonometryandparticles","description":"Creative particle movement cos sin tan sort functions"},"Forces":{"relativeUrl":"examples/simulate-forces","description":"Demonstration multiple force acting bodies natureofcodecom"},"Particle System":{"relativeUrl":"examples/simulate-particlesystem","description":"basic Particle System natureofcodecom"},"Flocking":{"relativeUrl":"examples/simulate-flocking","description":"Demonstration Craig Reynolds Flocking behavior http://www.red3d.com/cwr/ Rules Cohesion Separation Alignment natureofcodecom Drag mouse add boids system"},"Wolfram CA":{"relativeUrl":"examples/simulate-wolframca","description":"Simple demonstration Wolfram 1-dimensional cellular automata natureofcodecom"},"Game of Life":{"relativeUrl":"examples/simulate-gameoflife","description":"basic implementation John Conway's Game Life CA natureofcodecom"},"Spring":{"relativeUrl":"examples/simulate-spring","description":"Click drag release horizontal bar start spring"},"Brownian Motion":{"relativeUrl":"examples/simulate-brownianmotion","description":"Recording random movement continuous line Port original Processing examples page"},"Snowflakes":{"relativeUrl":"examples/simulate-snowflakeparticlesystem","description":"Particle system simulating motion falling snowflakes array objects hold snowflake particles Contributed Aatish Bhatia"},"Penrose Tiles":{"relativeUrl":"examples/simulate-penrose-tiles","description":"port David Blitz Penrose Tile processingorg/examples"},"Recursive Tree":{"relativeUrl":"examples/simulate-recursive-tree","description":"Renders simple tree-like structure recursion branching angle calculated function horizontal mouse location Move left change Based Daniel Shiffman's Recursive Tree Processing"},"The Mandelbrot Set":{"relativeUrl":"examples/simulate-mandelbrot","description":"Simple rendering Mandelbrot set Based Daniel Shiffman's Processing"},"Koch Curve":{"relativeUrl":"examples/simulate-koch","description":"Renders simple fractal Koch snowflake recursive level drawn sequence Daniel Shiffman"},"Bubble Sort":{"relativeUrl":"examples/simulate-bubblesort","description":"Sorts randomly distributed bars height ascending order simulating sorting process references Coding Challenge Train"},"Stepping Feet Illusion":{"relativeUrl":"examples/simulate-steepingfeet","description":"Stepping feet illusion famous psychological experiment bricks move speed moving Click mouse inside Canvas confirm Contributed Sagar Arora"},"Particles":{"relativeUrl":"examples/simulate-particle","description":"light-weight JavaScript library named particlejs creates pleasing particle system attempt recreate p5js Inspired Particlejs contributed Sagar Arora"},"Tickle":{"relativeUrl":"examples/interaction-tickle","description":"word tickle jitters cursor hovers tickled screen"},"Follow 1":{"relativeUrl":"examples/interaction-follow1","description":"line segment pushed pulled cursor Based code Keith Peters"},"Follow 2":{"relativeUrl":"examples/interaction-follow2","description":"two-segmented arm cursor position relative angle segments calculated atan2 sin cos Based code Keith Peters"},"Follow 3":{"relativeUrl":"examples/interaction-follow3","description":"segmented line mouse relative angle segment calculated atan2 position sin cos Based code Keith Peters"},"Wavemaker":{"relativeUrl":"examples/interaction-wavemaker","description":"illustrates waves water emerge particles oscillating place Move mouse direct wave Contributed Aatish Bhatia inspired Orbiters Dave Whyte"},"Reach 1":{"relativeUrl":"examples/interaction-reach1","description":"arm position mouse calculating angles atan2 Based code Keith Peters"},"Reach 2":{"relativeUrl":"examples/interaction-reach2","description":"arm position mouse calculating angles atan2 Based code Keith Peters"},"Reach 3":{"relativeUrl":"examples/interaction-reach3","description":"arm position ball calculating angles atan2 Based code Keith Peters"},"Arduino sensor data via WebJack":{"relativeUrl":"examples/interaction-arduinosensor","description":"WebJack read data Arduino sources audio -- basically turns modem https://github.com/publiclab/webjack Note p5-webjack libraries added indexhtml Working https://editor.p5js.org/jywarren/sketches/rkztwSt8M Testing https://www.youtube.com/watch?v=GtJW1Dlt3cg Load sketch https://create.arduino.cc/editor/jywarren/023158d8-be51-4c78-99ff-36c63126b554/preview output pin + ground microphone cable"},"Kaleidoscope":{"relativeUrl":"examples/interaction-kaleidoscope","description":"kaleidoscope optical instrument reflecting surfaces tilted angle replicate behavior Set number reflections symmetry variable start drawing screen Paste code Editor click save button download jpg file art created"},"Objects":{"relativeUrl":"examples/objects-objects","description":"Create Jitter class instantiate object move screen Adapted Started Processing Casey Reas Ben Fry"},"Multiple Objects":{"relativeUrl":"examples/objects-multiple-objects","description":"Create Jitter class instantiate multiple objects move screen"},"Array of Objects":{"relativeUrl":"examples/objects-objects-array","description":"Create Jitter class instantiate array objects move screen"},"Objects 2":{"relativeUrl":"examples/objects-objects-optional-arguments","description":"Ported hbarragan Move cursor image change speed positions geometry class MRect defines group lines"},"Directional":{"relativeUrl":"examples/lights-directional","description":"Move mouse change direction light Directional stronger hitting surface squarely weaker hits gentle angle directional scatters directions"},"Mixture":{"relativeUrl":"examples/lights-mixture","description":"Display box kinds lights"},"Non Orthogonal Reflection":{"relativeUrl":"examples/motion-non-orthogonal-reflection","description":"port David Blitz Reflection processingorg/examples"},"Linear":{"relativeUrl":"examples/motion-linear-motion","description":"Changing variable create moving line moves edge window set places back bottom screen"},"Bounce":{"relativeUrl":"examples/motion-bounce","description":"shape hits edge window reverses direction"},"Bouncy Bubbles":{"relativeUrl":"examples/motion-bouncy-bubbles","description":"based code Keith Peters Multiple-object collision"},"Morph":{"relativeUrl":"examples/motion-morph","description":"Changing shape interpolating vertices"},"Moving On Curves":{"relativeUrl":"examples/motion-moving-on-curves","description":"circles moves curve = x^4 Click mouse move position"},"Instantiation":{"relativeUrl":"examples/instance-mode-instantiating","description":"Create p5 instance variables global scope page"},"Input and Button":{"relativeUrl":"examples/dom-input-button","description":"Input text click button affect canvas"},"Slider":{"relativeUrl":"examples/dom-slider","description":"Move sliders control values background"},"Modifying the DOM":{"relativeUrl":"examples/dom-modify-dom","description":"Create DOM elements modify properties time draw called"},"Video":{"relativeUrl":"examples/dom-video","description":"Load video multiple formats toggle playing paused button press"},"Video Canvas":{"relativeUrl":"examples/dom-video-canvas","description":"Load video multiple formats draw canvas run locally running local server"},"Video Pixels":{"relativeUrl":"examples/dom-video-pixels","description":"Load video manipulate pixels draw canvas run locally running local server"},"Video Capture":{"relativeUrl":"examples/dom-capture","description":"Capture video webcam display canvas invert filter Note default capture feed shows hide uncommenting capturehide line"},"Drop":{"relativeUrl":"examples/dom-drop","description":"Drag image file canvas displayed"},"Continuous Lines":{"relativeUrl":"examples/drawing-continuous-lines","description":"Click drag mouse draw line"},"Patterns":{"relativeUrl":"examples/drawing-pattern","description":"Move cursor image draw software tool responds speed mouse"},"Pulses":{"relativeUrl":"examples/drawing-pulses","description":"Software drawing instruments follow rhythm abide rules independent drawn gestures form collaborative draftsperson controls aspects image software"},"Translate":{"relativeUrl":"examples/transform-translate","description":"translate function objects moved location window parameter sets x-axis offset y-axis shows transforms accumulate"},"Scale":{"relativeUrl":"examples/transform-scale","description":"Paramenters scale function values decimal percentages method call scale20 increase dimension shape percent Objects origin shows transforms accumulate translate interact depending order"},"Rotate":{"relativeUrl":"examples/transform-rotate","description":"Rotating square axis results expect send rotate function angle parameters values PI\\*2 TWO\\_PI roughly prefer angles degrees 0-360 radians method convert rotateradians90 identical statement rotatePI/2 numbered jitter added rotation odd seconds moves CW CCW speed determined"},"Arm":{"relativeUrl":"examples/transform-arm","description":"transform matrices create arm angle segment controlled mouseX mouseY position transformations applied inside push pop matrix group"},"Letters":{"relativeUrl":"examples/typography-letters","description":"Letters drawn screen loading font setting characteristics drawing letters loop unicode reference numbers automatically fill canvas characters grid Vowels selected specific color"},"Words":{"relativeUrl":"examples/typography-words","description":"text function writing words screen aligned left center textAlign shapes colored fill"},"Geometries":{"relativeUrl":"examples/3d-geometries","description":"3D primitives p5"},"Sine Cosine in 3D":{"relativeUrl":"examples/3d-sine-cosine-in-3d","description":"Sine cosine push / pop applied 3D"},"Multiple Lights":{"relativeUrl":"examples/3d-multiple-lights","description":"types lights sketch"},"Materials":{"relativeUrl":"examples/3d-materials","description":"types materials supported respond light differently Move mouse change position"},"Textures":{"relativeUrl":"examples/3d-textures","description":"Images videos supported texture"},"Orbit Control":{"relativeUrl":"examples/3d-orbit-control","description":"Orbit control drag move world"},"Blur using Framebuffer Depth":{"relativeUrl":"examples/3d-framebuffer-blur","description":"shader depth information p5Framebuffer draw scene focal blur"},"Simple Feedback":{"relativeUrl":"examples/3d-simple-feedback","description":"simple feedback effect achieved WebGL graphics buffers works drawing previous frame createGraphics buffer blended current takes advantage texture mapping"},"Clock":{"relativeUrl":"examples/input-clock","description":"current time read minute hour functions sin cos values set position hands"},"Constrain":{"relativeUrl":"examples/input-constrain","description":"Move mouse screen move circle program constrains box"},"Easing":{"relativeUrl":"examples/input-easing","description":"Move mouse screen symbol follow drawing frame animation program calculates difference position cursor distance larger pixel moves part current"},"Keyboard":{"relativeUrl":"examples/input-keyboard","description":"Click image give focus press letter keys create forms time space key unique identifying number numbers position shapes"},"Mouse 1D":{"relativeUrl":"examples/input-mouse1d","description":"Move mouse left shift balance mouseX variable control size color rectangles"},"Mouse 2D":{"relativeUrl":"examples/input-mouse2d","description":"Moving mouse position size box"},"Mouse Functions":{"relativeUrl":"examples/input-mouse-functions","description":"Click box drag screen"},"Mouse Signals":{"relativeUrl":"examples/input-mouse-signals","description":"Move click mouse generate signals top row signal mouseX middle mouseY bottom mouseIsPressed"},"Mouse Press":{"relativeUrl":"examples/input-mouseispressed","description":"Move mouse position shape Press button invert color"},"Storing Input":{"relativeUrl":"examples/input-storing-input","description":"Move mouse screen change position circles positions recorded array played back frame newest added end oldest deleted"},"soundFormats":{"relativeUrl":"examples/sound-soundformats","description":"Technically due patent issues single sound format supported web browsers mp3 latest versions major OS Windows mainstream operating systems ensure full compatibility include file multiple formats soundmp3 soundogg' Ogg open source alternative convert audio files friendly free online mediaio soundFormats method tells loadSound included sketch attempt load client's browser run locally p5sound library running local server"},"Play Mode":{"relativeUrl":"examples/sound-play-mode","description":"sustain mode sound overlap restart stop start Click mouse play file Trigger lots sounds Press key change playmode run locally p5sound library running local server"},"Pan Sound":{"relativeUrl":"examples/sound-pan-soundfile","description":"Click mouse play sound Ball position correlates panning run locally p5sound library file running local server"},"Sound Effect":{"relativeUrl":"examples/sound-sound-effect","description":"Play sound effect mouse clicked inside circle run locally p5sound library file running local server"},"Playback Rate":{"relativeUrl":"examples/sound-manipulate-sound","description":"Load SoundFile map playback rate mouseY volume mouseX Playback speed web audio context processings sound file information Slower rates increase duration decrease pitch played back slower frequency run locally p5sound library running local server"},"Noise Drum Envelope":{"relativeUrl":"examples/sound-noise-envelope","description":"White Noise random audio signal equal energy part frequency spectrum Envelope series fades defined time / pairs p5Env play p5Noise drum controlling output amplitude p5Amplitude level sound sketch draw green rectangle shows envelope action run locally p5sound library file"},"Note Envelope":{"relativeUrl":"examples/sound-note-envelope","description":"Envelope series fades defined time / pairs envelope play note controlling output amplitude oscillator p5Oscillator sends internal Web Audio GainNode p5Oscillatoroutput default node constant reset oscamp method takes control turning volume knob run locally p5sound library sound file"},"Oscillator Frequency":{"relativeUrl":"examples/sound-oscillator-waveform","description":"Control Oscillator view waveform FFT MouseX mapped frequency mouseY amplitude run locally p5sound library sound file"},"Mic Input":{"relativeUrl":"examples/sound-live-input","description":"audio input computer's microphone Make noise float ellipse Note p5AudioIn p5Amplitude object call getLevel creating run locally p5sound library running local server"},"Frequency Spectrum":{"relativeUrl":"examples/sound-fft-spectrum","description":"Visualize frequency spectrum live audio input run locally p5sound library running local server"},"Mic Threshold":{"relativeUrl":"examples/sound-mic-threshold","description":"Trigger event draw rectangle Audio Input volume surpasses threshold run locally p5sound library running local server"},"Filter LowPass":{"relativeUrl":"examples/sound-filter-lowpass","description":"Apply p5LowPass filter p5SoundFile Visualize sound FFT Map mouseX filter's cutoff frequency mouseY resonance/width BandPass run locally p5sound library file running local server"},"Filter BandPass":{"relativeUrl":"examples/sound-filter-bandpass","description":"Apply p5BandPass filter white noise Visualize sound FFT Map mouseX bandpass frequency mouseY resonance/width BandPass run locally p5sound library file running local server"},"Delay":{"relativeUrl":"examples/sound-delay","description":"Click mouse hear p5Delay process SoundFile MouseX controls Filter Frequency MouseY Time Resonance Visualize resulting sound's volume Amplitude object run locally p5sound library sound file running local server"},"Reverb":{"relativeUrl":"examples/sound-reverb","description":"Reverb depth perceived space sound noise processed reverb run locally p5sound library file running local server"},"Record Save Audio":{"relativeUrl":"examples/sound-record-save","description":"Record sound play back save wav file client's computer objects p5AudioIn mic / source p5SoundRecorder records p5SoundFile run locally p5sound library running local server"},"Acceleration Ball Bounce":{"relativeUrl":"examples/mobile-acceleration-ball-bounce","description":"Move ellipse based accelerationX accelerationY values bounces touch edge canvas"},"Simple Draw":{"relativeUrl":"examples/mobile-simple-draw","description":"Touch draw screen mouseX mouseY pmouseX pmouseY values"},"Acceleration Color":{"relativeUrl":"examples/mobile-acceleration-color","description":"deviceMoved detect device rotated background RGB color values mapped accelerationX accelerationY accelerationZ"},"Shake Ball Bounce":{"relativeUrl":"examples/mobile-shake-ball-bounce","description":"Create Ball class instantiate multiple objects move screen bounce touch edge canvas Detect shake event based total change accelerationX accelerationY speed slow detection"},"Tilted 3D Box":{"relativeUrl":"examples/mobile-tilted-3d-box","description":"mobile tilt box"},"Simple Shapes":{"relativeUrl":"examples/hello-p5-shapes","description":"examples includes circle square triangle flower"},"Interactivity 1":{"relativeUrl":"examples/hello-p5-interactivity","description":"circle color click"},"Interactivity 2":{"relativeUrl":"examples/hello-p5-interactivity","description":"circle color move slider"},"Animation":{"relativeUrl":"examples/hello-p5-animate","description":"circle moves"},"Weather":{"relativeUrl":"examples/hello-p5-weather","description":"grabs JSON weather data wwwmetaweathercom"},"Drawing":{"relativeUrl":"examples/hello-p5-drawing","description":"Generative painting program"},"Song":{"relativeUrl":"examples/hello-p5-song","description":"Play song include p5sound library work project"}},"libraries-fallback":{"p5.warp":{"relativeUrl":"libraries/","description":"Fast 3D domain warping using shaders."},"p5.xr":{"relativeUrl":"libraries/","description":"A library for creating VR and AR sketches with p5."}},"past-events-fallback":{"A Great Workshop That Happened":{"relativeUrl":"/past-events/example","description":"{/* import { PhotoCarousel } /components/PhotoCarousel */} great event ran NYU's ITP program month photos video someone's project made workshop friends taught class draw circles"},"Another Great Workshop That Happened":{"relativeUrl":"/past-events/other","description":"{/* import { PhotoCarousel } /components/PhotoCarousel */} great event ran NYU's ITP program month photos video someone's project made workshop friends taught class draw circles"}},"people-fallback":{"Lauren McCarthy":{"relativeUrl":"people/"}},"reference-fallback":{"stringify":{"relativeUrl":"/reference/JSON/stringify"},"log":{"relativeUrl":"/reference/p5/log"},"===":{"relativeUrl":"/reference/p5/==="},"ADD":{"relativeUrl":"/reference/p5/ADD"},"ALT":{"relativeUrl":"/reference/p5/ALT"},"ARROW":{"relativeUrl":"/reference/p5/ARROW"},"AUTO":{"relativeUrl":"/reference/p5/AUTO"},"AXES":{"relativeUrl":"/reference/p5/AXES"},"BACKSPACE":{"relativeUrl":"/reference/p5/BACKSPACE"},"BASELINE":{"relativeUrl":"/reference/p5/BASELINE"},"BEVEL":{"relativeUrl":"/reference/p5/BEVEL"},"blend":{"relativeUrl":"/reference/p5.Image/blend"},"BLUR":{"relativeUrl":"/reference/p5/BLUR"},"BOLD":{"relativeUrl":"/reference/p5/BOLD"},"BOLDITALIC":{"relativeUrl":"/reference/p5/BOLDITALIC"},"BOTTOM":{"relativeUrl":"/reference/p5/BOTTOM"},"BURN":{"relativeUrl":"/reference/p5/BURN"},"CENTER":{"relativeUrl":"/reference/p5/CENTER"},"char":{"relativeUrl":"/reference/p5/CHAR"},"CHORD":{"relativeUrl":"/reference/p5/CHORD"},"CLAMP":{"relativeUrl":"/reference/p5/CLAMP"},"CLOSE":{"relativeUrl":"/reference/p5/CLOSE"},"CONTAIN":{"relativeUrl":"/reference/p5/CONTAIN"},"CONTROL":{"relativeUrl":"/reference/p5/CONTROL"},"CORNER":{"relativeUrl":"/reference/p5/CORNER"},"CORNERS":{"relativeUrl":"/reference/p5/CORNERS"},"COVER":{"relativeUrl":"/reference/p5/COVER"},"CROSS":{"relativeUrl":"/reference/p5/CROSS"},"DARKEST":{"relativeUrl":"/reference/p5/DARKEST"},"degrees":{"relativeUrl":"/reference/p5/DEGREES"},"DELETE":{"relativeUrl":"/reference/p5/DELETE"},"DIFFERENCE":{"relativeUrl":"/reference/p5/DIFFERENCE"},"DILATE":{"relativeUrl":"/reference/p5/DILATE"},"DODGE":{"relativeUrl":"/reference/p5/DODGE"},"DOWN_ARROW":{"relativeUrl":"/reference/p5/DOWN_ARROW"},"ENTER":{"relativeUrl":"/reference/p5/ENTER"},"ERODE":{"relativeUrl":"/reference/p5/ERODE"},"ESCAPE":{"relativeUrl":"/reference/p5/ESCAPE"},"EXCLUSION":{"relativeUrl":"/reference/p5/EXCLUSION"},"FALLBACK":{"relativeUrl":"/reference/p5/FALLBACK"},"FLAT":{"relativeUrl":"/reference/p5/FLAT"},"float":{"relativeUrl":"/reference/p5/FLOAT"},"GRAY":{"relativeUrl":"/reference/p5/GRAY"},"GRID":{"relativeUrl":"/reference/p5/GRID"},"HALF_FLOAT":{"relativeUrl":"/reference/p5/HALF_FLOAT"},"HALF_PI":{"relativeUrl":"/reference/p5/HALF_PI"},"HAND":{"relativeUrl":"/reference/p5/HAND"},"HARD_LIGHT":{"relativeUrl":"/reference/p5/HARD_LIGHT"},"HSB":{"relativeUrl":"/reference/p5/HSB"},"HSL":{"relativeUrl":"/reference/p5/HSL"},"image":{"relativeUrl":"/reference/p5/IMAGE"},"IMMEDIATE":{"relativeUrl":"/reference/p5/IMMEDIATE"},"INVERT":{"relativeUrl":"/reference/p5/INVERT"},"ITALIC":{"relativeUrl":"/reference/p5/ITALIC"},"LABEL":{"relativeUrl":"/reference/p5/LABEL"},"LANDSCAPE":{"relativeUrl":"/reference/p5/LANDSCAPE"},"LEFT":{"relativeUrl":"/reference/p5/LEFT"},"LEFT_ARROW":{"relativeUrl":"/reference/p5/LEFT_ARROW"},"LIGHTEST":{"relativeUrl":"/reference/p5/LIGHTEST"},"LINEAR":{"relativeUrl":"/reference/p5/LINEAR"},"LINES":{"relativeUrl":"/reference/p5/LINES"},"LINE_LOOP":{"relativeUrl":"/reference/p5/LINE_LOOP"},"LINE_STRIP":{"relativeUrl":"/reference/p5/LINE_STRIP"},"MIRROR":{"relativeUrl":"/reference/p5/MIRROR"},"MITER":{"relativeUrl":"/reference/p5/MITER"},"MOVE":{"relativeUrl":"/reference/p5/MOVE"},"MULTIPLY":{"relativeUrl":"/reference/p5/MULTIPLY"},"NEAREST":{"relativeUrl":"/reference/p5/NEAREST"},"OPAQUE":{"relativeUrl":"/reference/p5/OPAQUE"},"OPEN":{"relativeUrl":"/reference/p5/OPEN"},"OPTION":{"relativeUrl":"/reference/p5/OPTION"},"OVERLAY":{"relativeUrl":"/reference/p5/OVERLAY"},"P2D":{"relativeUrl":"/reference/p5/P2D"},"PI":{"relativeUrl":"/reference/p5/PI"},"PIE":{"relativeUrl":"/reference/p5/PIE"},"POINTS":{"relativeUrl":"/reference/p5/POINTS"},"PORTRAIT":{"relativeUrl":"/reference/p5/PORTRAIT"},"POSTERIZE":{"relativeUrl":"/reference/p5/POSTERIZE"},"PROJECT":{"relativeUrl":"/reference/p5/PROJECT"},"QUADRATIC":{"relativeUrl":"/reference/p5/QUADRATIC"},"QUADS":{"relativeUrl":"/reference/p5/QUADS"},"QUAD_STRIP":{"relativeUrl":"/reference/p5/QUAD_STRIP"},"QUARTER_PI":{"relativeUrl":"/reference/p5/QUARTER_PI"},"radians":{"relativeUrl":"/reference/p5/RADIANS"},"RADIUS":{"relativeUrl":"/reference/p5/RADIUS"},"remove":{"relativeUrl":"/reference/p5.TypedDict/remove"},"REPEAT":{"relativeUrl":"/reference/p5/REPEAT"},"REPLACE":{"relativeUrl":"/reference/p5/REPLACE"},"return":{"relativeUrl":"/reference/p5/RETURN"},"RGB":{"relativeUrl":"/reference/p5/RGB"},"RGBA":{"relativeUrl":"/reference/p5/RGBA"},"RIGHT":{"relativeUrl":"/reference/p5/RIGHT"},"RIGHT_ARROW":{"relativeUrl":"/reference/p5/RIGHT_ARROW"},"round":{"relativeUrl":"/reference/p5/ROUND"},"SCREEN":{"relativeUrl":"/reference/p5/SCREEN"},"SHIFT":{"relativeUrl":"/reference/p5/SHIFT"},"SOFT_LIGHT":{"relativeUrl":"/reference/p5/SOFT_LIGHT"},"SUBTRACT":{"relativeUrl":"/reference/p5/SUBTRACT"},"TAB":{"relativeUrl":"/reference/p5/TAB"},"TAU":{"relativeUrl":"/reference/p5/TAU"},"TESS":{"relativeUrl":"/reference/p5/TESS"},"text":{"relativeUrl":"/reference/p5/TEXT"},"texture":{"relativeUrl":"/reference/p5/TEXTURE"},"THRESHOLD":{"relativeUrl":"/reference/p5/THRESHOLD"},"TOP":{"relativeUrl":"/reference/p5/TOP"},"TRIANGLES":{"relativeUrl":"/reference/p5/TRIANGLES"},"TRIANGLE_FAN":{"relativeUrl":"/reference/p5/TRIANGLE_FAN"},"TRIANGLE_STRIP":{"relativeUrl":"/reference/p5/TRIANGLE_STRIP"},"TWO_PI":{"relativeUrl":"/reference/p5/TWO_PI"},"UNSIGNED_BYTE":{"relativeUrl":"/reference/p5/UNSIGNED_BYTE"},"UNSIGNED_INT":{"relativeUrl":"/reference/p5/UNSIGNED_INT"},"UP_ARROW":{"relativeUrl":"/reference/p5/UP_ARROW"},"VERSION":{"relativeUrl":"/reference/p5/VERSION"},"WAIT":{"relativeUrl":"/reference/p5/WAIT"},"WEBGL":{"relativeUrl":"/reference/p5/WEBGL"},"WEBGL2":{"relativeUrl":"/reference/p5/WEBGL2"},"WORD":{"relativeUrl":"/reference/p5/WORD"},"abs":{"relativeUrl":"/reference/p5/abs"},"accelerationX":{"relativeUrl":"/reference/p5/accelerationX"},"accelerationY":{"relativeUrl":"/reference/p5/accelerationY"},"accelerationZ":{"relativeUrl":"/reference/p5/accelerationZ"},"acos":{"relativeUrl":"/reference/p5/acos"},"alpha":{"relativeUrl":"/reference/p5/alpha"},"ambientLight":{"relativeUrl":"/reference/p5/ambientLight"},"ambientMaterial":{"relativeUrl":"/reference/p5/ambientMaterial"},"angleMode":{"relativeUrl":"/reference/p5/angleMode"},"append":{"relativeUrl":"/reference/p5/append"},"applyMatrix":{"relativeUrl":"/reference/p5/applyMatrix"},"arc":{"relativeUrl":"/reference/p5/arc"},"arrayCopy":{"relativeUrl":"/reference/p5/arrayCopy"},"asin":{"relativeUrl":"/reference/p5/asin"},"atan":{"relativeUrl":"/reference/p5/atan"},"atan2":{"relativeUrl":"/reference/p5/atan2"},"background":{"relativeUrl":"/reference/p5/background"},"beginClip":{"relativeUrl":"/reference/p5/beginClip"},"beginContour":{"relativeUrl":"/reference/p5/beginContour"},"beginGeometry":{"relativeUrl":"/reference/p5/beginGeometry"},"beginShape":{"relativeUrl":"/reference/p5/beginShape"},"BEZIER":{"relativeUrl":"/reference/p5/bezier"},"bezierDetail":{"relativeUrl":"/reference/p5/bezierDetail"},"bezierPoint":{"relativeUrl":"/reference/p5/bezierPoint"},"bezierTangent":{"relativeUrl":"/reference/p5/bezierTangent"},"bezierVertex":{"relativeUrl":"/reference/p5/bezierVertex"},"blendMode":{"relativeUrl":"/reference/p5/blendMode"},"blue":{"relativeUrl":"/reference/p5/blue"},"boolean":{"relativeUrl":"/reference/p5/boolean"},"box":{"relativeUrl":"/reference/p5/box"},"brightness":{"relativeUrl":"/reference/p5/brightness"},"buildGeometry":{"relativeUrl":"/reference/p5/buildGeometry"},"byte":{"relativeUrl":"/reference/p5/byte"},"camera":{"relativeUrl":"/reference/p5.Camera/camera"},"ceil":{"relativeUrl":"/reference/p5/ceil"},"changed":{"relativeUrl":"/reference/p5/changed"},"circle":{"relativeUrl":"/reference/p5/circle"},"class":{"relativeUrl":"/reference/p5.Element/class"},"clear":{"relativeUrl":"/reference/p5.TypedDict/clear"},"clearDepth":{"relativeUrl":"/reference/p5/clearDepth"},"clearStorage":{"relativeUrl":"/reference/p5/clearStorage"},"clip":{"relativeUrl":"/reference/p5/clip"},"color":{"relativeUrl":"/reference/p5.Framebuffer/color"},"colorMode":{"relativeUrl":"/reference/p5/colorMode"},"concat":{"relativeUrl":"/reference/p5/concat"},"cone":{"relativeUrl":"/reference/p5/cone"},"const":{"relativeUrl":"/reference/p5/const"},"constrain":{"relativeUrl":"/reference/p5/constrain"},"copy":{"relativeUrl":"/reference/p5.Vector/copy"},"cos":{"relativeUrl":"/reference/p5/cos"},"createA":{"relativeUrl":"/reference/p5/createA"},"createAudio":{"relativeUrl":"/reference/p5/createAudio"},"createButton":{"relativeUrl":"/reference/p5/createButton"},"createCamera":{"relativeUrl":"/reference/p5.Framebuffer/createCamera"},"createCanvas":{"relativeUrl":"/reference/p5/createCanvas"},"createCapture":{"relativeUrl":"/reference/p5/createCapture"},"createCheckbox":{"relativeUrl":"/reference/p5/createCheckbox"},"createColorPicker":{"relativeUrl":"/reference/p5/createColorPicker"},"createConvolver":{"relativeUrl":"/reference/p5/createConvolver"},"createDiv":{"relativeUrl":"/reference/p5/createDiv"},"createElement":{"relativeUrl":"/reference/p5/createElement"},"createFileInput":{"relativeUrl":"/reference/p5/createFileInput"},"createFilterShader":{"relativeUrl":"/reference/p5/createFilterShader"},"createFramebuffer":{"relativeUrl":"/reference/p5.Graphics/createFramebuffer"},"createGraphics":{"relativeUrl":"/reference/p5/createGraphics"},"createImage":{"relativeUrl":"/reference/p5/createImage"},"createImg":{"relativeUrl":"/reference/p5/createImg"},"createInput":{"relativeUrl":"/reference/p5/createInput"},"createNumberDict":{"relativeUrl":"/reference/p5/createNumberDict"},"createP":{"relativeUrl":"/reference/p5/createP"},"createRadio":{"relativeUrl":"/reference/p5/createRadio"},"createSelect":{"relativeUrl":"/reference/p5/createSelect"},"createShader":{"relativeUrl":"/reference/p5/createShader"},"createSlider":{"relativeUrl":"/reference/p5/createSlider"},"createSpan":{"relativeUrl":"/reference/p5/createSpan"},"createStringDict":{"relativeUrl":"/reference/p5/createStringDict"},"createVector":{"relativeUrl":"/reference/p5/createVector"},"createVideo":{"relativeUrl":"/reference/p5/createVideo"},"createWriter":{"relativeUrl":"/reference/p5/createWriter"},"cursor":{"relativeUrl":"/reference/p5/cursor"},"CURVE":{"relativeUrl":"/reference/p5/curve"},"curveDetail":{"relativeUrl":"/reference/p5/curveDetail"},"curvePoint":{"relativeUrl":"/reference/p5/curvePoint"},"curveTangent":{"relativeUrl":"/reference/p5/curveTangent"},"curveTightness":{"relativeUrl":"/reference/p5/curveTightness"},"curveVertex":{"relativeUrl":"/reference/p5/curveVertex"},"cylinder":{"relativeUrl":"/reference/p5/cylinder"},"day":{"relativeUrl":"/reference/p5/day"},"debugMode":{"relativeUrl":"/reference/p5/debugMode"},"deltaTime":{"relativeUrl":"/reference/p5/deltaTime"},"describe":{"relativeUrl":"/reference/p5/describe"},"describeElement":{"relativeUrl":"/reference/p5/describeElement"},"deviceMoved":{"relativeUrl":"/reference/p5/deviceMoved"},"deviceOrientation":{"relativeUrl":"/reference/p5/deviceOrientation"},"deviceShaken":{"relativeUrl":"/reference/p5/deviceShaken"},"deviceTurned":{"relativeUrl":"/reference/p5/deviceTurned"},"directionalLight":{"relativeUrl":"/reference/p5/directionalLight"},"disableFriendlyErrors":{"relativeUrl":"/reference/p5/disableFriendlyErrors"},"displayDensity":{"relativeUrl":"/reference/p5/displayDensity"},"displayHeight":{"relativeUrl":"/reference/p5/displayHeight"},"displayWidth":{"relativeUrl":"/reference/p5/displayWidth"},"dist":{"relativeUrl":"/reference/p5.Vector/dist"},"doubleClicked":{"relativeUrl":"/reference/p5.Element/doubleClicked"},"draw":{"relativeUrl":"/reference/p5.Framebuffer/draw"},"drawingContext":{"relativeUrl":"/reference/p5/drawingContext"},"ellipse":{"relativeUrl":"/reference/p5/ellipse"},"ellipseMode":{"relativeUrl":"/reference/p5/ellipseMode"},"ellipsoid":{"relativeUrl":"/reference/p5/ellipsoid"},"emissiveMaterial":{"relativeUrl":"/reference/p5/emissiveMaterial"},"endClip":{"relativeUrl":"/reference/p5/endClip"},"endContour":{"relativeUrl":"/reference/p5/endContour"},"endGeometry":{"relativeUrl":"/reference/p5/endGeometry"},"endShape":{"relativeUrl":"/reference/p5/endShape"},"erase":{"relativeUrl":"/reference/p5/erase"},"exitPointerLock":{"relativeUrl":"/reference/p5/exitPointerLock"},"exp":{"relativeUrl":"/reference/p5/exp"},"FILL":{"relativeUrl":"/reference/p5/fill"},"filter":{"relativeUrl":"/reference/p5.Image/filter"},"floor":{"relativeUrl":"/reference/p5/floor"},"focused":{"relativeUrl":"/reference/p5/focused"},"for":{"relativeUrl":"/reference/p5/for"},"fract":{"relativeUrl":"/reference/p5/fract"},"frameCount":{"relativeUrl":"/reference/p5/frameCount"},"frameRate":{"relativeUrl":"/reference/p5/frameRate"},"freeGeometry":{"relativeUrl":"/reference/p5/freeGeometry"},"freqToMidi":{"relativeUrl":"/reference/p5/freqToMidi"},"frustum":{"relativeUrl":"/reference/p5.Camera/frustum"},"fullscreen":{"relativeUrl":"/reference/p5/fullscreen"},"function":{"relativeUrl":"/reference/p5/function"},"get":{"relativeUrl":"/reference/p5.TypedDict/get"},"getAudioContext":{"relativeUrl":"/reference/p5/getAudioContext"},"getItem":{"relativeUrl":"/reference/p5/getItem"},"getOutputVolume":{"relativeUrl":"/reference/p5/getOutputVolume"},"getTargetFrameRate":{"relativeUrl":"/reference/p5/getTargetFrameRate"},"getURL":{"relativeUrl":"/reference/p5/getURL"},"getURLParams":{"relativeUrl":"/reference/p5/getURLParams"},"getURLPath":{"relativeUrl":"/reference/p5/getURLPath"},"green":{"relativeUrl":"/reference/p5/green"},"gridOutput":{"relativeUrl":"/reference/p5/gridOutput"},"&gt;":{"relativeUrl":"/reference/p5/gt"},"&gt;=":{"relativeUrl":"/reference/p5/gte"},"height":{"relativeUrl":"/reference/p5.Image/height"},"hex":{"relativeUrl":"/reference/p5/hex"},"hour":{"relativeUrl":"/reference/p5/hour"},"httpDo":{"relativeUrl":"/reference/p5/httpDo"},"httpGet":{"relativeUrl":"/reference/p5/httpGet"},"httpPost":{"relativeUrl":"/reference/p5/httpPost"},"hue":{"relativeUrl":"/reference/p5/hue"},"if-else":{"relativeUrl":"/reference/p5/if-else"},"imageLight":{"relativeUrl":"/reference/p5/imageLight"},"imageMode":{"relativeUrl":"/reference/p5/imageMode"},"input":{"relativeUrl":"/reference/p5.AudioIn/input"},"int":{"relativeUrl":"/reference/p5/int"},"isLooping":{"relativeUrl":"/reference/p5.SoundFile/isLooping"},"join":{"relativeUrl":"/reference/p5/join"},"key":{"relativeUrl":"/reference/p5/key"},"keyCode":{"relativeUrl":"/reference/p5/keyCode"},"keyIsDown":{"relativeUrl":"/reference/p5/keyIsDown"},"keyIsPressed":{"relativeUrl":"/reference/p5/keyIsPressed"},"keyPressed":{"relativeUrl":"/reference/p5/keyPressed"},"keyReleased":{"relativeUrl":"/reference/p5/keyReleased"},"keyTyped":{"relativeUrl":"/reference/p5/keyTyped"},"lerp":{"relativeUrl":"/reference/p5.Vector/lerp"},"lerpColor":{"relativeUrl":"/reference/p5/lerpColor"},"let":{"relativeUrl":"/reference/p5/let"},"lightFalloff":{"relativeUrl":"/reference/p5/lightFalloff"},"lightness":{"relativeUrl":"/reference/p5/lightness"},"lights":{"relativeUrl":"/reference/p5/lights"},"line":{"relativeUrl":"/reference/p5/line"},"loadBytes":{"relativeUrl":"/reference/p5/loadBytes"},"loadFont":{"relativeUrl":"/reference/p5/loadFont"},"loadImage":{"relativeUrl":"/reference/p5/loadImage"},"loadJSON":{"relativeUrl":"/reference/p5/loadJSON"},"loadModel":{"relativeUrl":"/reference/p5/loadModel"},"loadPixels":{"relativeUrl":"/reference/p5.Image/loadPixels"},"loadShader":{"relativeUrl":"/reference/p5/loadShader"},"loadSound":{"relativeUrl":"/reference/p5/loadSound"},"loadStrings":{"relativeUrl":"/reference/p5/loadStrings"},"loadTable":{"relativeUrl":"/reference/p5/loadTable"},"loadXML":{"relativeUrl":"/reference/p5/loadXML"},"loop":{"relativeUrl":"/reference/p5.SoundFile/loop"},"&lt;":{"relativeUrl":"/reference/p5/lt"},"&lt;=":{"relativeUrl":"/reference/p5/lte"},"mag":{"relativeUrl":"/reference/p5.Vector/mag"},"map":{"relativeUrl":"/reference/p5/map"},"match":{"relativeUrl":"/reference/p5/match"},"matchAll":{"relativeUrl":"/reference/p5/matchAll"},"max":{"relativeUrl":"/reference/p5/max"},"metalness":{"relativeUrl":"/reference/p5/metalness"},"midiToFreq":{"relativeUrl":"/reference/p5/midiToFreq"},"millis":{"relativeUrl":"/reference/p5/millis"},"min":{"relativeUrl":"/reference/p5/min"},"minute":{"relativeUrl":"/reference/p5/minute"},"model":{"relativeUrl":"/reference/p5/model"},"month":{"relativeUrl":"/reference/p5/month"},"mouseButton":{"relativeUrl":"/reference/p5/mouseButton"},"mouseClicked":{"relativeUrl":"/reference/p5.Element/mouseClicked"},"mouseDragged":{"relativeUrl":"/reference/p5/mouseDragged"},"mouseIsPressed":{"relativeUrl":"/reference/p5/mouseIsPressed"},"mouseMoved":{"relativeUrl":"/reference/p5.Element/mouseMoved"},"mousePressed":{"relativeUrl":"/reference/p5.Element/mousePressed"},"mouseReleased":{"relativeUrl":"/reference/p5.Element/mouseReleased"},"mouseWheel":{"relativeUrl":"/reference/p5.Element/mouseWheel"},"mouseX":{"relativeUrl":"/reference/p5/mouseX"},"mouseY":{"relativeUrl":"/reference/p5/mouseY"},"movedX":{"relativeUrl":"/reference/p5/movedX"},"movedY":{"relativeUrl":"/reference/p5/movedY"},"nf":{"relativeUrl":"/reference/p5/nf"},"nfc":{"relativeUrl":"/reference/p5/nfc"},"nfp":{"relativeUrl":"/reference/p5/nfp"},"nfs":{"relativeUrl":"/reference/p5/nfs"},"noCanvas":{"relativeUrl":"/reference/p5/noCanvas"},"noCursor":{"relativeUrl":"/reference/p5/noCursor"},"noDebugMode":{"relativeUrl":"/reference/p5/noDebugMode"},"noErase":{"relativeUrl":"/reference/p5/noErase"},"noFill":{"relativeUrl":"/reference/p5/noFill"},"noLights":{"relativeUrl":"/reference/p5/noLights"},"noLoop":{"relativeUrl":"/reference/p5.Score/noLoop"},"noSmooth":{"relativeUrl":"/reference/p5/noSmooth"},"noStroke":{"relativeUrl":"/reference/p5/noStroke"},"noTint":{"relativeUrl":"/reference/p5/noTint"},"noise":{"relativeUrl":"/reference/p5/noise"},"noiseDetail":{"relativeUrl":"/reference/p5/noiseDetail"},"noiseSeed":{"relativeUrl":"/reference/p5/noiseSeed"},"norm":{"relativeUrl":"/reference/p5/norm"},"NORMAL":{"relativeUrl":"/reference/p5/normal"},"normalMaterial":{"relativeUrl":"/reference/p5/normalMaterial"},"number":{"relativeUrl":"/reference/p5/number"},"object":{"relativeUrl":"/reference/p5/object"},"orbitControl":{"relativeUrl":"/reference/p5/orbitControl"},"ortho":{"relativeUrl":"/reference/p5.Camera/ortho"},"outputVolume":{"relativeUrl":"/reference/p5/outputVolume"},"p5.Camera":{"relativeUrl":"/reference/p5/p5.Camera"},"p5.Color":{"relativeUrl":"/reference/p5/p5.Color"},"p5.Element":{"relativeUrl":"/reference/p5/p5.Element"},"p5.File":{"relativeUrl":"/reference/p5/p5.File"},"p5.Font":{"relativeUrl":"/reference/p5/p5.Font"},"p5.Framebuffer":{"relativeUrl":"/reference/p5/p5.Framebuffer"},"p5.Geometry":{"relativeUrl":"/reference/p5/p5.Geometry"},"p5.Graphics":{"relativeUrl":"/reference/p5/p5.Graphics"},"p5.Image":{"relativeUrl":"/reference/p5/p5.Image"},"p5.MediaElement":{"relativeUrl":"/reference/p5/p5.MediaElement"},"p5.NumberDict":{"relativeUrl":"/reference/p5/p5.NumberDict"},"p5.PrintWriter":{"relativeUrl":"/reference/p5/p5.PrintWriter"},"p5.Renderer":{"relativeUrl":"/reference/p5/p5.Renderer"},"p5.Shader":{"relativeUrl":"/reference/p5/p5.Shader"},"p5.StringDict":{"relativeUrl":"/reference/p5/p5.StringDict"},"p5.Table":{"relativeUrl":"/reference/p5/p5.Table"},"p5.TableRow":{"relativeUrl":"/reference/p5/p5.TableRow"},"p5.TypedDict":{"relativeUrl":"/reference/p5/p5.TypedDict"},"p5.Vector":{"relativeUrl":"/reference/p5/p5.Vector"},"p5.XML":{"relativeUrl":"/reference/p5/p5.XML"},"p5":{"relativeUrl":"/reference/p5/p5"},"pAccelerationX":{"relativeUrl":"/reference/p5/pAccelerationX"},"pAccelerationY":{"relativeUrl":"/reference/p5/pAccelerationY"},"pAccelerationZ":{"relativeUrl":"/reference/p5/pAccelerationZ"},"pRotationX":{"relativeUrl":"/reference/p5/pRotationX"},"pRotationY":{"relativeUrl":"/reference/p5/pRotationY"},"pRotationZ":{"relativeUrl":"/reference/p5/pRotationZ"},"panorama":{"relativeUrl":"/reference/p5/panorama"},"perspective":{"relativeUrl":"/reference/p5.Camera/perspective"},"pixelDensity":{"relativeUrl":"/reference/p5.Image/pixelDensity"},"pixels":{"relativeUrl":"/reference/p5.Image/pixels"},"plane":{"relativeUrl":"/reference/p5/plane"},"pmouseX":{"relativeUrl":"/reference/p5/pmouseX"},"pmouseY":{"relativeUrl":"/reference/p5/pmouseY"},"point":{"relativeUrl":"/reference/p5/point"},"pointLight":{"relativeUrl":"/reference/p5/pointLight"},"pop":{"relativeUrl":"/reference/p5/pop"},"pow":{"relativeUrl":"/reference/p5/pow"},"preload":{"relativeUrl":"/reference/p5/preload"},"print":{"relativeUrl":"/reference/p5.TypedDict/print"},"push":{"relativeUrl":"/reference/p5/push"},"pwinMouseX":{"relativeUrl":"/reference/p5/pwinMouseX"},"pwinMouseY":{"relativeUrl":"/reference/p5/pwinMouseY"},"quad":{"relativeUrl":"/reference/p5/quad"},"quadraticVertex":{"relativeUrl":"/reference/p5/quadraticVertex"},"random":{"relativeUrl":"/reference/p5/random"},"randomGaussian":{"relativeUrl":"/reference/p5/randomGaussian"},"randomSeed":{"relativeUrl":"/reference/p5/randomSeed"},"rect":{"relativeUrl":"/reference/p5/rect"},"rectMode":{"relativeUrl":"/reference/p5/rectMode"},"red":{"relativeUrl":"/reference/p5/red"},"redraw":{"relativeUrl":"/reference/p5/redraw"},"removeElements":{"relativeUrl":"/reference/p5/removeElements"},"removeItem":{"relativeUrl":"/reference/p5/removeItem"},"requestPointerLock":{"relativeUrl":"/reference/p5/requestPointerLock"},"resetMatrix":{"relativeUrl":"/reference/p5/resetMatrix"},"resetShader":{"relativeUrl":"/reference/p5/resetShader"},"resizeCanvas":{"relativeUrl":"/reference/p5/resizeCanvas"},"reverse":{"relativeUrl":"/reference/p5/reverse"},"rotate":{"relativeUrl":"/reference/p5.Vector/rotate"},"rotateX":{"relativeUrl":"/reference/p5/rotateX"},"rotateY":{"relativeUrl":"/reference/p5/rotateY"},"rotateZ":{"relativeUrl":"/reference/p5/rotateZ"},"rotationX":{"relativeUrl":"/reference/p5/rotationX"},"rotationY":{"relativeUrl":"/reference/p5/rotationY"},"rotationZ":{"relativeUrl":"/reference/p5/rotationZ"},"sampleRate":{"relativeUrl":"/reference/p5.SoundFile/sampleRate"},"saturation":{"relativeUrl":"/reference/p5/saturation"},"save":{"relativeUrl":"/reference/p5.SoundFile/save"},"saveCanvas":{"relativeUrl":"/reference/p5/saveCanvas"},"saveFrames":{"relativeUrl":"/reference/p5/saveFrames"},"saveGif":{"relativeUrl":"/reference/p5/saveGif"},"saveJSON":{"relativeUrl":"/reference/p5.TypedDict/saveJSON"},"saveSound":{"relativeUrl":"/reference/p5/saveSound"},"saveStrings":{"relativeUrl":"/reference/p5/saveStrings"},"saveTable":{"relativeUrl":"/reference/p5.TypedDict/saveTable"},"scale":{"relativeUrl":"/reference/p5.Oscillator/scale"},"second":{"relativeUrl":"/reference/p5/second"},"select":{"relativeUrl":"/reference/p5/select"},"selectAll":{"relativeUrl":"/reference/p5/selectAll"},"set":{"relativeUrl":"/reference/p5.Vector/set"},"setAttributes":{"relativeUrl":"/reference/p5/setAttributes"},"setBPM":{"relativeUrl":"/reference/p5.Score/setBPM"},"setCamera":{"relativeUrl":"/reference/p5/setCamera"},"setMoveThreshold":{"relativeUrl":"/reference/p5/setMoveThreshold"},"setShakeThreshold":{"relativeUrl":"/reference/p5/setShakeThreshold"},"setup":{"relativeUrl":"/reference/p5/setup"},"shader":{"relativeUrl":"/reference/p5/shader"},"shearX":{"relativeUrl":"/reference/p5/shearX"},"shearY":{"relativeUrl":"/reference/p5/shearY"},"shininess":{"relativeUrl":"/reference/p5/shininess"},"shorten":{"relativeUrl":"/reference/p5/shorten"},"shuffle":{"relativeUrl":"/reference/p5/shuffle"},"sin":{"relativeUrl":"/reference/p5/sin"},"SMOOTH":{"relativeUrl":"/reference/p5/smooth"},"sort":{"relativeUrl":"/reference/p5/sort"},"soundFormats":{"relativeUrl":"/reference/p5/soundFormats"},"soundOut":{"relativeUrl":"/reference/p5/soundOut"},"specularColor":{"relativeUrl":"/reference/p5/specularColor"},"specularMaterial":{"relativeUrl":"/reference/p5/specularMaterial"},"sphere":{"relativeUrl":"/reference/p5/sphere"},"splice":{"relativeUrl":"/reference/p5/splice"},"split":{"relativeUrl":"/reference/p5/split"},"splitTokens":{"relativeUrl":"/reference/p5/splitTokens"},"spotLight":{"relativeUrl":"/reference/p5/spotLight"},"sq":{"relativeUrl":"/reference/p5/sq"},"sqrt":{"relativeUrl":"/reference/p5/sqrt"},"SQUARE":{"relativeUrl":"/reference/p5/square"},"storeItem":{"relativeUrl":"/reference/p5/storeItem"},"str":{"relativeUrl":"/reference/p5/str"},"string":{"relativeUrl":"/reference/p5/string"},"STROKE":{"relativeUrl":"/reference/p5/stroke"},"strokeCap":{"relativeUrl":"/reference/p5/strokeCap"},"strokeJoin":{"relativeUrl":"/reference/p5/strokeJoin"},"strokeWeight":{"relativeUrl":"/reference/p5/strokeWeight"},"subset":{"relativeUrl":"/reference/p5/subset"},"tan":{"relativeUrl":"/reference/p5/tan"},"textAlign":{"relativeUrl":"/reference/p5/textAlign"},"textAscent":{"relativeUrl":"/reference/p5/textAscent"},"textDescent":{"relativeUrl":"/reference/p5/textDescent"},"textFont":{"relativeUrl":"/reference/p5/textFont"},"textLeading":{"relativeUrl":"/reference/p5/textLeading"},"textOutput":{"relativeUrl":"/reference/p5/textOutput"},"textSize":{"relativeUrl":"/reference/p5/textSize"},"textStyle":{"relativeUrl":"/reference/p5/textStyle"},"textWidth":{"relativeUrl":"/reference/p5/textWidth"},"textWrap":{"relativeUrl":"/reference/p5/textWrap"},"textureMode":{"relativeUrl":"/reference/p5/textureMode"},"textureWrap":{"relativeUrl":"/reference/p5/textureWrap"},"tint":{"relativeUrl":"/reference/p5/tint"},"torus":{"relativeUrl":"/reference/p5/torus"},"touchEnded":{"relativeUrl":"/reference/p5.Element/touchEnded"},"touchMoved":{"relativeUrl":"/reference/p5.Element/touchMoved"},"touchStarted":{"relativeUrl":"/reference/p5.Element/touchStarted"},"touches":{"relativeUrl":"/reference/p5/touches"},"translate":{"relativeUrl":"/reference/p5/translate"},"triangle":{"relativeUrl":"/reference/p5/triangle"},"trim":{"relativeUrl":"/reference/p5.Table/trim"},"turnAxis":{"relativeUrl":"/reference/p5/turnAxis"},"unchar":{"relativeUrl":"/reference/p5/unchar"},"unhex":{"relativeUrl":"/reference/p5/unhex"},"updatePixels":{"relativeUrl":"/reference/p5.Image/updatePixels"},"userStartAudio":{"relativeUrl":"/reference/p5/userStartAudio"},"vertex":{"relativeUrl":"/reference/p5/vertex"},"webglVersion":{"relativeUrl":"/reference/p5/webglVersion"},"while":{"relativeUrl":"/reference/p5/while"},"width":{"relativeUrl":"/reference/p5.Pulse/width"},"winMouseX":{"relativeUrl":"/reference/p5/winMouseX"},"winMouseY":{"relativeUrl":"/reference/p5/winMouseY"},"windowHeight":{"relativeUrl":"/reference/p5/windowHeight"},"windowResized":{"relativeUrl":"/reference/p5/windowResized"},"windowWidth":{"relativeUrl":"/reference/p5/windowWidth"},"year":{"relativeUrl":"/reference/p5/year"},"getLevel":{"relativeUrl":"/reference/p5.AudioIn/getLevel"},"setInput":{"relativeUrl":"/reference/p5.SoundRecorder/setInput"},"smooth":{"relativeUrl":"/reference/p5.FFT/smooth"},"toggleNormalize":{"relativeUrl":"/reference/p5.Amplitude/toggleNormalize"},"amp":{"relativeUrl":"/reference/p5.Reverb/amp"},"amplitude":{"relativeUrl":"/reference/p5.AudioIn/amplitude"},"connect":{"relativeUrl":"/reference/p5.SoundFile/connect"},"currentSource":{"relativeUrl":"/reference/p5.AudioIn/currentSource"},"disconnect":{"relativeUrl":"/reference/p5.SoundFile/disconnect"},"enabled":{"relativeUrl":"/reference/p5.AudioIn/enabled"},"getSources":{"relativeUrl":"/reference/p5.AudioIn/getSources"},"mediaStream":{"relativeUrl":"/reference/p5.AudioIn/mediaStream"},"output":{"relativeUrl":"/reference/p5.AudioIn/output"},"setSource":{"relativeUrl":"/reference/p5.AudioIn/setSource"},"start":{"relativeUrl":"/reference/p5.SoundLoop/start"},"stop":{"relativeUrl":"/reference/p5.SoundRecorder/stop"},"stream":{"relativeUrl":"/reference/p5.AudioIn/stream"},"centerX":{"relativeUrl":"/reference/p5.Camera/centerX"},"centerY":{"relativeUrl":"/reference/p5.Camera/centerY"},"centerZ":{"relativeUrl":"/reference/p5.Camera/centerZ"},"eyeX":{"relativeUrl":"/reference/p5.Camera/eyeX"},"eyeY":{"relativeUrl":"/reference/p5.Camera/eyeY"},"eyeZ":{"relativeUrl":"/reference/p5.Camera/eyeZ"},"lookAt":{"relativeUrl":"/reference/p5.Camera/lookAt"},"move":{"relativeUrl":"/reference/p5.Camera/move"},"pan":{"relativeUrl":"/reference/p5.SoundFile/pan"},"setPosition":{"relativeUrl":"/reference/p5.Camera/setPosition"},"slerp":{"relativeUrl":"/reference/p5.Vector/slerp"},"tilt":{"relativeUrl":"/reference/p5.Camera/tilt"},"upX":{"relativeUrl":"/reference/p5.Camera/upX"},"upY":{"relativeUrl":"/reference/p5.Camera/upY"},"upZ":{"relativeUrl":"/reference/p5.Camera/upZ"},"setAlpha":{"relativeUrl":"/reference/p5.Color/setAlpha"},"setBlue":{"relativeUrl":"/reference/p5.Color/setBlue"},"setGreen":{"relativeUrl":"/reference/p5.Color/setGreen"},"setRed":{"relativeUrl":"/reference/p5.Color/setRed"},"toString":{"relativeUrl":"/reference/p5.Vector/toString"},"attack":{"relativeUrl":"/reference/p5.MonoSynth/attack"},"compressor":{"relativeUrl":"/reference/p5.Compressor/compressor"},"knee":{"relativeUrl":"/reference/p5.Compressor/knee"},"process":{"relativeUrl":"/reference/p5.Reverb/process"},"ratio":{"relativeUrl":"/reference/p5.Compressor/ratio"},"reduction":{"relativeUrl":"/reference/p5.Compressor/reduction"},"release":{"relativeUrl":"/reference/p5.MonoSynth/release"},"threshold":{"relativeUrl":"/reference/p5.Compressor/threshold"},"addImpulse":{"relativeUrl":"/reference/p5.Convolver/addImpulse"},"convolverNode":{"relativeUrl":"/reference/p5.Convolver/convolverNode"},"impulses":{"relativeUrl":"/reference/p5.Convolver/impulses"},"resetImpulse":{"relativeUrl":"/reference/p5.Convolver/resetImpulse"},"toggleImpulse":{"relativeUrl":"/reference/p5.Convolver/toggleImpulse"},"delayTime":{"relativeUrl":"/reference/p5.Delay/delayTime"},"feedback":{"relativeUrl":"/reference/p5.Delay/feedback"},"leftDelay":{"relativeUrl":"/reference/p5.Delay/leftDelay"},"rightDelay":{"relativeUrl":"/reference/p5.Delay/rightDelay"},"setType":{"relativeUrl":"/reference/p5.Oscillator/setType"},"WaveShaperNode":{"relativeUrl":"/reference/p5.Distortion/WaveShaperNode"},"getAmount":{"relativeUrl":"/reference/p5.Distortion/getAmount"},"getOversample":{"relativeUrl":"/reference/p5.Distortion/getOversample"},"bands":{"relativeUrl":"/reference/p5.EQ/bands"},"chain":{"relativeUrl":"/reference/p5.Effect/chain"},"drywet":{"relativeUrl":"/reference/p5.Effect/drywet"},"addClass":{"relativeUrl":"/reference/p5.Element/addClass"},"attribute":{"relativeUrl":"/reference/p5.Element/attribute"},"center":{"relativeUrl":"/reference/p5.Element/center"},"child":{"relativeUrl":"/reference/p5.Element/child"},"dragLeave":{"relativeUrl":"/reference/p5.Element/dragLeave"},"dragOver":{"relativeUrl":"/reference/p5.Element/dragOver"},"draggable":{"relativeUrl":"/reference/p5.Element/draggable"},"drop":{"relativeUrl":"/reference/p5.Element/drop"},"elt":{"relativeUrl":"/reference/p5.Element/elt"},"hasClass":{"relativeUrl":"/reference/p5.Element/hasClass"},"hide":{"relativeUrl":"/reference/p5.Element/hide"},"html":{"relativeUrl":"/reference/p5.Element/html"},"id":{"relativeUrl":"/reference/p5.Element/id"},"mouseOut":{"relativeUrl":"/reference/p5.Element/mouseOut"},"mouseOver":{"relativeUrl":"/reference/p5.Element/mouseOver"},"parent":{"relativeUrl":"/reference/p5.Element/parent"},"position":{"relativeUrl":"/reference/p5.Element/position"},"removeAttribute":{"relativeUrl":"/reference/p5.Element/removeAttribute"},"removeClass":{"relativeUrl":"/reference/p5.Element/removeClass"},"show":{"relativeUrl":"/reference/p5.Element/show"},"size":{"relativeUrl":"/reference/p5.TypedDict/size"},"style":{"relativeUrl":"/reference/p5.Element/style"},"toggleClass":{"relativeUrl":"/reference/p5.Element/toggleClass"},"value":{"relativeUrl":"/reference/p5.Element/value"},"add":{"relativeUrl":"/reference/p5.Vector/add"},"attackLevel":{"relativeUrl":"/reference/p5.Envelope/attackLevel"},"attackTime":{"relativeUrl":"/reference/p5.Envelope/attackTime"},"decayLevel":{"relativeUrl":"/reference/p5.Envelope/decayLevel"},"decayTime":{"relativeUrl":"/reference/p5.Envelope/decayTime"},"mult":{"relativeUrl":"/reference/p5.Vector/mult"},"play":{"relativeUrl":"/reference/p5.SoundFile/play"},"ramp":{"relativeUrl":"/reference/p5.Envelope/ramp"},"releaseLevel":{"relativeUrl":"/reference/p5.Envelope/releaseLevel"},"releaseTime":{"relativeUrl":"/reference/p5.Envelope/releaseTime"},"setADSR":{"relativeUrl":"/reference/p5.PolySynth/setADSR"},"setExp":{"relativeUrl":"/reference/p5.Envelope/setExp"},"setRange":{"relativeUrl":"/reference/p5.Envelope/setRange"},"triggerAttack":{"relativeUrl":"/reference/p5.MonoSynth/triggerAttack"},"triggerRelease":{"relativeUrl":"/reference/p5.MonoSynth/triggerRelease"},"analyze":{"relativeUrl":"/reference/p5.FFT/analyze"},"getCentroid":{"relativeUrl":"/reference/p5.FFT/getCentroid"},"getEnergy":{"relativeUrl":"/reference/p5.FFT/getEnergy"},"getOctaveBands":{"relativeUrl":"/reference/p5.FFT/getOctaveBands"},"linAverages":{"relativeUrl":"/reference/p5.FFT/linAverages"},"logAverages":{"relativeUrl":"/reference/p5.FFT/logAverages"},"waveform":{"relativeUrl":"/reference/p5.FFT/waveform"},"data":{"relativeUrl":"/reference/p5.File/data"},"file":{"relativeUrl":"/reference/p5.File/file"},"name":{"relativeUrl":"/reference/p5.File/name"},"subtype":{"relativeUrl":"/reference/p5.File/subtype"},"type":{"relativeUrl":"/reference/p5.File/type"},"biquadFilter":{"relativeUrl":"/reference/p5.Filter/biquadFilter"},"freq":{"relativeUrl":"/reference/p5.Oscillator/freq"},"gain":{"relativeUrl":"/reference/p5.Filter/gain"},"res":{"relativeUrl":"/reference/p5.Filter/res"},"toggle":{"relativeUrl":"/reference/p5.Filter/toggle"},"font":{"relativeUrl":"/reference/p5.Font/font"},"textBounds":{"relativeUrl":"/reference/p5.Font/textBounds"},"textToPoints":{"relativeUrl":"/reference/p5.Font/textToPoints"},"autoSized":{"relativeUrl":"/reference/p5.Framebuffer/autoSized"},"begin":{"relativeUrl":"/reference/p5.Framebuffer/begin"},"depth":{"relativeUrl":"/reference/p5.Framebuffer/depth"},"end":{"relativeUrl":"/reference/p5.Framebuffer/end"},"resize":{"relativeUrl":"/reference/p5.Image/resize"},"averageNormals":{"relativeUrl":"/reference/p5.Geometry/averageNormals"},"averagePoleNormals":{"relativeUrl":"/reference/p5.Geometry/averagePoleNormals"},"clearColors":{"relativeUrl":"/reference/p5.Geometry/clearColors"},"computeFaces":{"relativeUrl":"/reference/p5.Geometry/computeFaces"},"computeNormals":{"relativeUrl":"/reference/p5.Geometry/computeNormals"},"flipU":{"relativeUrl":"/reference/p5.Geometry/flipU"},"flipV":{"relativeUrl":"/reference/p5.Geometry/flipV"},"normalize":{"relativeUrl":"/reference/p5.Vector/normalize"},"reset":{"relativeUrl":"/reference/p5.Image/reset"},"delay":{"relativeUrl":"/reference/p5.Image/delay"},"getCurrentFrame":{"relativeUrl":"/reference/p5.Image/getCurrentFrame"},"mask":{"relativeUrl":"/reference/p5.Image/mask"},"numFrames":{"relativeUrl":"/reference/p5.Image/numFrames"},"pause":{"relativeUrl":"/reference/p5.SoundLoop/pause"},"setFrame":{"relativeUrl":"/reference/p5.Image/setFrame"},"addCue":{"relativeUrl":"/reference/p5.SoundFile/addCue"},"autoplay":{"relativeUrl":"/reference/p5.MediaElement/autoplay"},"clearCues":{"relativeUrl":"/reference/p5.SoundFile/clearCues"},"duration":{"relativeUrl":"/reference/p5.SoundFile/duration"},"hideControls":{"relativeUrl":"/reference/p5.MediaElement/hideControls"},"onended":{"relativeUrl":"/reference/p5.SoundFile/onended"},"removeCue":{"relativeUrl":"/reference/p5.SoundFile/removeCue"},"showControls":{"relativeUrl":"/reference/p5.MediaElement/showControls"},"speed":{"relativeUrl":"/reference/p5.MediaElement/speed"},"src":{"relativeUrl":"/reference/p5.MediaElement/src"},"time":{"relativeUrl":"/reference/p5.MediaElement/time"},"volume":{"relativeUrl":"/reference/p5.MediaElement/volume"},"decay":{"relativeUrl":"/reference/p5.MonoSynth/decay"},"dispose":{"relativeUrl":"/reference/p5.PolySynth/dispose"},"sustain":{"relativeUrl":"/reference/p5.MonoSynth/sustain"},"div":{"relativeUrl":"/reference/p5.Vector/div"},"maxKey":{"relativeUrl":"/reference/p5.NumberDict/maxKey"},"maxValue":{"relativeUrl":"/reference/p5.NumberDict/maxValue"},"minKey":{"relativeUrl":"/reference/p5.NumberDict/minKey"},"minValue":{"relativeUrl":"/reference/p5.NumberDict/minValue"},"sub":{"relativeUrl":"/reference/p5.Vector/sub"},"getAmp":{"relativeUrl":"/reference/p5.Oscillator/getAmp"},"getFreq":{"relativeUrl":"/reference/p5.Oscillator/getFreq"},"getPan":{"relativeUrl":"/reference/p5.SoundFile/getPan"},"getType":{"relativeUrl":"/reference/p5.Oscillator/getType"},"phase":{"relativeUrl":"/reference/p5.Oscillator/phase"},"maxDist":{"relativeUrl":"/reference/p5.Panner3D/maxDist"},"orient":{"relativeUrl":"/reference/p5.Panner3D/orient"},"orientX":{"relativeUrl":"/reference/p5.Panner3D/orientX"},"orientY":{"relativeUrl":"/reference/p5.Panner3D/orientY"},"orientZ":{"relativeUrl":"/reference/p5.Panner3D/orientZ"},"panner":{"relativeUrl":"/reference/p5.Panner3D/panner"},"positionX":{"relativeUrl":"/reference/p5.Panner3D/positionX"},"positionY":{"relativeUrl":"/reference/p5.Panner3D/positionY"},"positionZ":{"relativeUrl":"/reference/p5.Panner3D/positionZ"},"rollof":{"relativeUrl":"/reference/p5.Panner3D/rollof"},"setFalloff":{"relativeUrl":"/reference/p5.Panner3D/setFalloff"},"addPhrase":{"relativeUrl":"/reference/p5.Part/addPhrase"},"getBPM":{"relativeUrl":"/reference/p5.Part/getBPM"},"getPhrase":{"relativeUrl":"/reference/p5.Part/getPhrase"},"onStep":{"relativeUrl":"/reference/p5.Part/onStep"},"removePhrase":{"relativeUrl":"/reference/p5.Part/removePhrase"},"replaceSequence":{"relativeUrl":"/reference/p5.Part/replaceSequence"},"isDetected":{"relativeUrl":"/reference/p5.PeakDetect/isDetected"},"onPeak":{"relativeUrl":"/reference/p5.PeakDetect/onPeak"},"update":{"relativeUrl":"/reference/p5.PeakDetect/update"},"sequence":{"relativeUrl":"/reference/p5.Phrase/sequence"},"AudioVoice":{"relativeUrl":"/reference/p5.PolySynth/AudioVoice"},"noteADSR":{"relativeUrl":"/reference/p5.PolySynth/noteADSR"},"noteAttack":{"relativeUrl":"/reference/p5.PolySynth/noteAttack"},"noteRelease":{"relativeUrl":"/reference/p5.PolySynth/noteRelease"},"notes":{"relativeUrl":"/reference/p5.PolySynth/notes"},"polyvalue":{"relativeUrl":"/reference/p5.PolySynth/polyvalue"},"close":{"relativeUrl":"/reference/p5.PrintWriter/close"},"write":{"relativeUrl":"/reference/p5.PrintWriter/write"},"copyToContext":{"relativeUrl":"/reference/p5.Shader/copyToContext"},"setUniform":{"relativeUrl":"/reference/p5.Shader/setUniform"},"channels":{"relativeUrl":"/reference/p5.SoundFile/channels"},"currentTime":{"relativeUrl":"/reference/p5.SoundFile/currentTime"},"frames":{"relativeUrl":"/reference/p5.SoundFile/frames"},"getBlob":{"relativeUrl":"/reference/p5.SoundFile/getBlob"},"getPeaks":{"relativeUrl":"/reference/p5.SoundFile/getPeaks"},"isLoaded":{"relativeUrl":"/reference/p5.SoundFile/isLoaded"},"isPaused":{"relativeUrl":"/reference/p5.SoundFile/isPaused"},"isPlaying":{"relativeUrl":"/reference/p5.SoundFile/isPlaying"},"jump":{"relativeUrl":"/reference/p5.SoundFile/jump"},"playMode":{"relativeUrl":"/reference/p5.SoundFile/playMode"},"rate":{"relativeUrl":"/reference/p5.SoundFile/rate"},"reverseBuffer":{"relativeUrl":"/reference/p5.SoundFile/reverseBuffer"},"setBuffer":{"relativeUrl":"/reference/p5.SoundFile/setBuffer"},"setLoop":{"relativeUrl":"/reference/p5.SoundFile/setLoop"},"setPath":{"relativeUrl":"/reference/p5.SoundFile/setPath"},"setVolume":{"relativeUrl":"/reference/p5.SoundFile/setVolume"},"bpm":{"relativeUrl":"/reference/p5.SoundLoop/bpm"},"interval":{"relativeUrl":"/reference/p5.SoundLoop/interval"},"iterations":{"relativeUrl":"/reference/p5.SoundLoop/iterations"},"maxIterations":{"relativeUrl":"/reference/p5.SoundLoop/maxIterations"},"musicalTimeMode":{"relativeUrl":"/reference/p5.SoundLoop/musicalTimeMode"},"syncedStart":{"relativeUrl":"/reference/p5.SoundLoop/syncedStart"},"timeSignature":{"relativeUrl":"/reference/p5.SoundLoop/timeSignature"},"record":{"relativeUrl":"/reference/p5.SoundRecorder/record"},"addColumn":{"relativeUrl":"/reference/p5.Table/addColumn"},"addRow":{"relativeUrl":"/reference/p5.Table/addRow"},"clearRows":{"relativeUrl":"/reference/p5.Table/clearRows"},"columns":{"relativeUrl":"/reference/p5.Table/columns"},"findRow":{"relativeUrl":"/reference/p5.Table/findRow"},"findRows":{"relativeUrl":"/reference/p5.Table/findRows"},"getArray":{"relativeUrl":"/reference/p5.Table/getArray"},"getColumn":{"relativeUrl":"/reference/p5.Table/getColumn"},"getColumnCount":{"relativeUrl":"/reference/p5.Table/getColumnCount"},"getNum":{"relativeUrl":"/reference/p5.XML/getNum"},"getObject":{"relativeUrl":"/reference/p5.Table/getObject"},"getRow":{"relativeUrl":"/reference/p5.Table/getRow"},"getRowCount":{"relativeUrl":"/reference/p5.Table/getRowCount"},"getRows":{"relativeUrl":"/reference/p5.Table/getRows"},"getString":{"relativeUrl":"/reference/p5.XML/getString"},"matchRow":{"relativeUrl":"/reference/p5.Table/matchRow"},"matchRows":{"relativeUrl":"/reference/p5.Table/matchRows"},"removeColumn":{"relativeUrl":"/reference/p5.Table/removeColumn"},"removeRow":{"relativeUrl":"/reference/p5.Table/removeRow"},"removeTokens":{"relativeUrl":"/reference/p5.Table/removeTokens"},"rows":{"relativeUrl":"/reference/p5.Table/rows"},"setNum":{"relativeUrl":"/reference/p5.TableRow/setNum"},"setString":{"relativeUrl":"/reference/p5.TableRow/setString"},"create":{"relativeUrl":"/reference/p5.TypedDict/create"},"hasKey":{"relativeUrl":"/reference/p5.TypedDict/hasKey"},"angleBetween":{"relativeUrl":"/reference/p5.Vector/angleBetween"},"array":{"relativeUrl":"/reference/p5.Vector/array"},"cross":{"relativeUrl":"/reference/p5.Vector/cross"},"dot":{"relativeUrl":"/reference/p5.Vector/dot"},"equals":{"relativeUrl":"/reference/p5.Vector/equals"},"fromAngle":{"relativeUrl":"/reference/p5.Vector/fromAngle"},"fromAngles":{"relativeUrl":"/reference/p5.Vector/fromAngles"},"heading":{"relativeUrl":"/reference/p5.Vector/heading"},"limit":{"relativeUrl":"/reference/p5.Vector/limit"},"magSq":{"relativeUrl":"/reference/p5.Vector/magSq"},"random2D":{"relativeUrl":"/reference/p5.Vector/random2D"},"random3D":{"relativeUrl":"/reference/p5.Vector/random3D"},"reflect":{"relativeUrl":"/reference/p5.Vector/reflect"},"rem":{"relativeUrl":"/reference/p5.Vector/rem"},"setHeading":{"relativeUrl":"/reference/p5.Vector/setHeading"},"setMag":{"relativeUrl":"/reference/p5.Vector/setMag"},"x":{"relativeUrl":"/reference/p5.Vector/x"},"y":{"relativeUrl":"/reference/p5.Vector/y"},"z":{"relativeUrl":"/reference/p5.Vector/z"},"addChild":{"relativeUrl":"/reference/p5.XML/addChild"},"getAttributeCount":{"relativeUrl":"/reference/p5.XML/getAttributeCount"},"getChild":{"relativeUrl":"/reference/p5.XML/getChild"},"getChildren":{"relativeUrl":"/reference/p5.XML/getChildren"},"getContent":{"relativeUrl":"/reference/p5.XML/getContent"},"getName":{"relativeUrl":"/reference/p5.XML/getName"},"getParent":{"relativeUrl":"/reference/p5.XML/getParent"},"hasAttribute":{"relativeUrl":"/reference/p5.XML/hasAttribute"},"hasChildren":{"relativeUrl":"/reference/p5.XML/hasChildren"},"listAttributes":{"relativeUrl":"/reference/p5.XML/listAttributes"},"listChildren":{"relativeUrl":"/reference/p5.XML/listChildren"},"removeChild":{"relativeUrl":"/reference/p5.XML/removeChild"},"serialize":{"relativeUrl":"/reference/p5.XML/serialize"},"setAttribute":{"relativeUrl":"/reference/p5.XML/setAttribute"},"setContent":{"relativeUrl":"/reference/p5.XML/setContent"},"setName":{"relativeUrl":"/reference/p5.XML/setName"},"p5.Amplitude":{"relativeUrl":"/reference/p5.sound/p5.Amplitude"},"p5.AudioIn":{"relativeUrl":"/reference/p5.sound/p5.AudioIn"},"p5.AudioVoice":{"relativeUrl":"/reference/p5.sound/p5.AudioVoice"},"p5.BandPass":{"relativeUrl":"/reference/p5.sound/p5.BandPass"},"p5.Compressor":{"relativeUrl":"/reference/p5.sound/p5.Compressor"},"p5.Convolver":{"relativeUrl":"/reference/p5.sound/p5.Convolver"},"p5.Delay":{"relativeUrl":"/reference/p5.sound/p5.Delay"},"p5.Distortion":{"relativeUrl":"/reference/p5.sound/p5.Distortion"},"p5.EQ":{"relativeUrl":"/reference/p5.sound/p5.EQ"},"p5.Effect":{"relativeUrl":"/reference/p5.sound/p5.Effect"},"p5.Envelope":{"relativeUrl":"/reference/p5.sound/p5.Envelope"},"p5.FFT":{"relativeUrl":"/reference/p5.sound/p5.FFT"},"p5.Filter":{"relativeUrl":"/reference/p5.sound/p5.Filter"},"p5.Gain":{"relativeUrl":"/reference/p5.sound/p5.Gain"},"p5.HighPass":{"relativeUrl":"/reference/p5.sound/p5.HighPass"},"p5.LowPass":{"relativeUrl":"/reference/p5.sound/p5.LowPass"},"p5.MonoSynth":{"relativeUrl":"/reference/p5.sound/p5.MonoSynth"},"p5.Noise":{"relativeUrl":"/reference/p5.sound/p5.Noise"},"p5.OnsetDetect":{"relativeUrl":"/reference/p5.sound/p5.OnsetDetect"},"p5.Oscillator":{"relativeUrl":"/reference/p5.sound/p5.Oscillator"},"p5.Panner3D":{"relativeUrl":"/reference/p5.sound/p5.Panner3D"},"p5.Part":{"relativeUrl":"/reference/p5.sound/p5.Part"},"p5.PeakDetect":{"relativeUrl":"/reference/p5.sound/p5.PeakDetect"},"p5.Phrase":{"relativeUrl":"/reference/p5.sound/p5.Phrase"},"p5.PolySynth":{"relativeUrl":"/reference/p5.sound/p5.PolySynth"},"p5.Pulse":{"relativeUrl":"/reference/p5.sound/p5.Pulse"},"p5.Reverb":{"relativeUrl":"/reference/p5.sound/p5.Reverb"},"p5.SawOsc":{"relativeUrl":"/reference/p5.sound/p5.SawOsc"},"p5.Score":{"relativeUrl":"/reference/p5.sound/p5.Score"},"p5.SinOsc":{"relativeUrl":"/reference/p5.sound/p5.SinOsc"},"p5.SoundFile":{"relativeUrl":"/reference/p5.sound/p5.SoundFile"},"p5.SoundLoop":{"relativeUrl":"/reference/p5.sound/p5.SoundLoop"},"p5.SoundRecorder":{"relativeUrl":"/reference/p5.sound/p5.SoundRecorder"},"p5.SqrOsc":{"relativeUrl":"/reference/p5.sound/p5.SqrOsc"},"p5.TriOsc":{"relativeUrl":"/reference/p5.sound/p5.TriOsc"}},"sketches-fallback":{"Placeholder sketch name":{"relativeUrl":"/sketches/example","description":"Zaron Chen"}},"tutorials-fallback":{"Coordinates and Transformations":{"relativeUrl":"/tutorials/coordinates-and-transformations","description":"TODO"},"Creating Custom Geometry in WebGL":{"relativeUrl":"/tutorials/custom-geometry","description":"TODO"},"Example: How to draw a rainbow circle":{"relativeUrl":"/tutorials/example","description":"Drawing a circle is easy, but how to you draw a circle filled with all the colors of the rainbow?"},"Introduction to Shaders":{"relativeUrl":"/tutorials/intro-to-shaders","description":"TODO"},"Layered Rendering with Framebuffers":{"relativeUrl":"/tutorials/layered-rendering-with-framebuffers","description":"TODO"},"Lights, Camera, Materials":{"relativeUrl":"/tutorials/lights-camera-materials","description":"TODO"},"Optimizing WebGL Sketches":{"relativeUrl":"/tutorials/optimizing-webgl-sketches","description":"TODO"}}}